pahole.o: ELF 64-bit LSB relocatable, UCB RISC-V, RVC, double-float ABI, version 1 (SYSV), with debug_info, not stripped
The 5 biggest data structures:
cu	344	1
function	264	1
class	216	1
_IO_FILE	216	2
type	176	0
btf_encoder__new: 'pahole.o' doesn't have '.data..percpu' section
Found 0 per-CPU variables!
Found 121 functions!
File pahole.o:
[1] TYPEDEF size_t type_id=3
[2] CONST (anon) type_id=1
[3] INT long unsigned int size=8 nr_bits=64 encoding=(none)
[4] TYPEDEF __gnuc_va_list type_id=5
[5] PTR (anon) type_id=0
[6] INT unsigned char size=1 nr_bits=8 encoding=(none)
[7] INT short unsigned int size=2 nr_bits=16 encoding=(none)
[8] CONST (anon) type_id=7
[9] INT unsigned int size=4 nr_bits=32 encoding=(none)
[10] TYPEDEF __int8_t type_id=11
[11] INT signed char size=1 nr_bits=8 encoding=SIGNED
[12] TYPEDEF __uint8_t type_id=6
[13] INT short int size=2 nr_bits=16 encoding=SIGNED
[14] TYPEDEF __uint16_t type_id=7
[15] TYPEDEF __int32_t type_id=16
[16] INT int size=4 nr_bits=32 encoding=SIGNED
[17] CONST (anon) type_id=16
[18] TYPEDEF __uint32_t type_id=9
[19] TYPEDEF __int64_t type_id=20
[20] INT long int size=8 nr_bits=64 encoding=SIGNED
[21] TYPEDEF __uint64_t type_id=3
[22] TYPEDEF __off_t type_id=20
[23] TYPEDEF __off64_t type_id=20
[24] PTR (anon) type_id=0
[25] RESTRICT (anon) type_id=24
[26] PTR (anon) type_id=28
[27] RESTRICT (anon) type_id=26
[28] INT char size=1 nr_bits=8 encoding=(none)
[29] CONST (anon) type_id=28
[30] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=4
[31] STRUCT _IO_FILE size=216
	_flags type_id=16 bits_offset=0
	_IO_read_ptr type_id=26 bits_offset=64
	_IO_read_end type_id=26 bits_offset=128
	_IO_read_base type_id=26 bits_offset=192
	_IO_write_base type_id=26 bits_offset=256
	_IO_write_ptr type_id=26 bits_offset=320
	_IO_write_end type_id=26 bits_offset=384
	_IO_buf_base type_id=26 bits_offset=448
	_IO_buf_end type_id=26 bits_offset=512
	_IO_save_base type_id=26 bits_offset=576
	_IO_backup_base type_id=26 bits_offset=640
	_IO_save_end type_id=26 bits_offset=704
	_markers type_id=35 bits_offset=768
	_chain type_id=36 bits_offset=832
	_fileno type_id=16 bits_offset=896
	_flags2 type_id=16 bits_offset=928
	_old_offset type_id=22 bits_offset=960
	_cur_column type_id=7 bits_offset=1024
	_vtable_offset type_id=11 bits_offset=1040
	_shortbuf type_id=37 bits_offset=1048
	_lock type_id=38 bits_offset=1088
	_offset type_id=23 bits_offset=1152
	_codecvt type_id=40 bits_offset=1216
	_wide_data type_id=42 bits_offset=1280
	_freeres_list type_id=36 bits_offset=1344
	_freeres_buf type_id=24 bits_offset=1408
	__pad5 type_id=1 bits_offset=1472
	_mode type_id=16 bits_offset=1536
	_unused2 type_id=43 bits_offset=1568
[32] TYPEDEF FILE type_id=31
[33] TYPEDEF _IO_lock_t type_id=0
[34] FWD _IO_marker struct
[35] PTR (anon) type_id=34
[36] PTR (anon) type_id=31
[37] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=1
[38] PTR (anon) type_id=33
[39] FWD _IO_codecvt struct
[40] PTR (anon) type_id=39
[41] FWD _IO_wide_data struct
[42] PTR (anon) type_id=41
[43] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=20
[44] PTR (anon) type_id=29
[45] RESTRICT (anon) type_id=44
[46] TYPEDEF va_list type_id=4
[47] TYPEDEF off_t type_id=22
[48] PTR (anon) type_id=32
[49] RESTRICT (anon) type_id=48
[50] ENUM (anon) size=4
	_ISupper val=256
	_ISlower val=512
	_ISalpha val=1024
	_ISdigit val=2048
	_ISxdigit val=4096
	_ISspace val=8192
	_ISprint val=16384
	_ISgraph val=32768
	_ISblank val=1
	_IScntrl val=2
	_ISpunct val=4
	_ISalnum val=8
[51] PTR (anon) type_id=8
[52] PTR (anon) type_id=16
[53] RESTRICT (anon) type_id=52
[54] TYPEDEF error_t type_id=16
[55] STRUCT argp_option size=48
	name type_id=44 bits_offset=0
	key type_id=16 bits_offset=64
	arg type_id=44 bits_offset=128
	flags type_id=16 bits_offset=192
	doc type_id=44 bits_offset=256
	group type_id=16 bits_offset=320
[56] CONST (anon) type_id=55
[57] TYPEDEF argp_parser_t type_id=58
[58] PTR (anon) type_id=59
[59] FUNC_PROTO (anon) return=54 args=(16 (null), 26 (null), 60 (null))
[60] PTR (anon) type_id=62
[61] RESTRICT (anon) type_id=60
[62] STRUCT argp_state size=96
	root_argp type_id=71 bits_offset=0
	argc type_id=16 bits_offset=64
	argv type_id=73 bits_offset=128
	next type_id=16 bits_offset=192
	flags type_id=9 bits_offset=224
	arg_num type_id=9 bits_offset=256
	quoted type_id=16 bits_offset=288
	input type_id=24 bits_offset=320
	child_inputs type_id=75 bits_offset=384
	hook type_id=24 bits_offset=448
	name type_id=26 bits_offset=512
	err_stream type_id=48 bits_offset=576
	out_stream type_id=48 bits_offset=640
	pstate type_id=24 bits_offset=704
[63] STRUCT argp size=56
	options type_id=65 bits_offset=0
	parser type_id=57 bits_offset=64
	args_doc type_id=44 bits_offset=128
	doc type_id=44 bits_offset=192
	children type_id=68 bits_offset=256
	help_filter type_id=70 bits_offset=320
	argp_domain type_id=44 bits_offset=384
[64] CONST (anon) type_id=63
[65] PTR (anon) type_id=56
[66] STRUCT argp_child size=32
	argp type_id=71 bits_offset=0
	flags type_id=16 bits_offset=64
	header type_id=44 bits_offset=128
	group type_id=16 bits_offset=192
[67] CONST (anon) type_id=66
[68] PTR (anon) type_id=67
[69] FUNC_PROTO (anon) return=26 args=(16 (null), 44 (null), 24 (null))
[70] PTR (anon) type_id=69
[71] PTR (anon) type_id=64
[72] RESTRICT (anon) type_id=71
[73] PTR (anon) type_id=26
[74] RESTRICT (anon) type_id=73
[75] PTR (anon) type_id=24
[76] ENUM (anon) size=4
	DW_TAG_array_type val=1
	DW_TAG_class_type val=2
	DW_TAG_entry_point val=3
	DW_TAG_enumeration_type val=4
	DW_TAG_formal_parameter val=5
	DW_TAG_imported_declaration val=8
	DW_TAG_label val=10
	DW_TAG_lexical_block val=11
	DW_TAG_member val=13
	DW_TAG_pointer_type val=15
	DW_TAG_reference_type val=16
	DW_TAG_compile_unit val=17
	DW_TAG_string_type val=18
	DW_TAG_structure_type val=19
	DW_TAG_subroutine_type val=21
	DW_TAG_typedef val=22
	DW_TAG_union_type val=23
	DW_TAG_unspecified_parameters val=24
	DW_TAG_variant val=25
	DW_TAG_common_block val=26
	DW_TAG_common_inclusion val=27
	DW_TAG_inheritance val=28
	DW_TAG_inlined_subroutine val=29
	DW_TAG_module val=30
	DW_TAG_ptr_to_member_type val=31
	DW_TAG_set_type val=32
	DW_TAG_subrange_type val=33
	DW_TAG_with_stmt val=34
	DW_TAG_access_declaration val=35
	DW_TAG_base_type val=36
	DW_TAG_catch_block val=37
	DW_TAG_const_type val=38
	DW_TAG_constant val=39
	DW_TAG_enumerator val=40
	DW_TAG_file_type val=41
	DW_TAG_friend val=42
	DW_TAG_namelist val=43
	DW_TAG_namelist_item val=44
	DW_TAG_packed_type val=45
	DW_TAG_subprogram val=46
	DW_TAG_template_type_parameter val=47
	DW_TAG_template_value_parameter val=48
	DW_TAG_thrown_type val=49
	DW_TAG_try_block val=50
	DW_TAG_variant_part val=51
	DW_TAG_variable val=52
	DW_TAG_volatile_type val=53
	DW_TAG_dwarf_procedure val=54
	DW_TAG_restrict_type val=55
	DW_TAG_interface_type val=56
	DW_TAG_namespace val=57
	DW_TAG_imported_module val=58
	DW_TAG_unspecified_type val=59
	DW_TAG_partial_unit val=60
	DW_TAG_imported_unit val=61
	DW_TAG_condition val=63
	DW_TAG_shared_type val=64
	DW_TAG_type_unit val=65
	DW_TAG_rvalue_reference_type val=66
	DW_TAG_template_alias val=67
	DW_TAG_coarray_type val=68
	DW_TAG_generic_subrange val=69
	DW_TAG_dynamic_type val=70
	DW_TAG_atomic_type val=71
	DW_TAG_call_site val=72
	DW_TAG_call_site_parameter val=73
	DW_TAG_skeleton_unit val=74
	DW_TAG_immutable_type val=75
	DW_TAG_lo_user val=16512
	DW_TAG_MIPS_loop val=16513
	DW_TAG_format_label val=16641
	DW_TAG_function_template val=16642
	DW_TAG_class_template val=16643
	DW_TAG_GNU_BINCL val=16644
	DW_TAG_GNU_EINCL val=16645
	DW_TAG_GNU_template_template_param val=16646
	DW_TAG_GNU_template_parameter_pack val=16647
	DW_TAG_GNU_formal_parameter_pack val=16648
	DW_TAG_GNU_call_site val=16649
	DW_TAG_GNU_call_site_parameter val=16650
	DW_TAG_hi_user val=65535
[77] TYPEDEF int8_t type_id=10
[78] TYPEDEF int32_t type_id=15
[79] TYPEDEF int64_t type_id=19
[80] TYPEDEF uint8_t type_id=12
[81] CONST (anon) type_id=80
[82] TYPEDEF uint16_t type_id=14
[83] CONST (anon) type_id=82
[84] TYPEDEF uint32_t type_id=18
[85] CONST (anon) type_id=84
[86] TYPEDEF uint64_t type_id=21
[87] INT long long unsigned int size=8 nr_bits=64 encoding=(none)
[88] STRUCT __pthread_internal_list size=16
	__prev type_id=89 bits_offset=0
	__next type_id=89 bits_offset=64
[89] PTR (anon) type_id=88
[90] TYPEDEF __pthread_list_t type_id=88
[91] STRUCT __pthread_mutex_s size=40
	__lock type_id=16 bits_offset=0
	__count type_id=9 bits_offset=32
	__owner type_id=16 bits_offset=64
	__nusers type_id=9 bits_offset=96
	__kind type_id=16 bits_offset=128
	__spins type_id=16 bits_offset=160
	__list type_id=90 bits_offset=192
[92] UNION (anon) size=40
	__data type_id=91 bits_offset=0
	__size type_id=93 bits_offset=0
	__align type_id=20 bits_offset=0
[93] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=40
[94] TYPEDEF pthread_mutex_t type_id=92
[95] INT long long int size=8 nr_bits=64 encoding=SIGNED
[96] INT double size=8 nr_bits=64 encoding=(none)
[97] ENUM (anon) size=4
	PTHREAD_MUTEX_TIMED_NP val=0
	PTHREAD_MUTEX_RECURSIVE_NP val=1
	PTHREAD_MUTEX_ERRORCHECK_NP val=2
	PTHREAD_MUTEX_ADAPTIVE_NP val=3
	PTHREAD_MUTEX_NORMAL val=0
	PTHREAD_MUTEX_RECURSIVE val=1
	PTHREAD_MUTEX_ERRORCHECK val=2
	PTHREAD_MUTEX_DEFAULT val=0
[98] TYPEDEF __compar_fn_t type_id=99
[99] PTR (anon) type_id=100
[100] FUNC_PROTO (anon) return=16 args=(101 (null), 101 (null))
[101] PTR (anon) type_id=102
[102] CONST (anon) type_id=0
[103] ENUM (anon) size=4
	_SC_ARG_MAX val=0
	_SC_CHILD_MAX val=1
	_SC_CLK_TCK val=2
	_SC_NGROUPS_MAX val=3
	_SC_OPEN_MAX val=4
	_SC_STREAM_MAX val=5
	_SC_TZNAME_MAX val=6
	_SC_JOB_CONTROL val=7
	_SC_SAVED_IDS val=8
	_SC_REALTIME_SIGNALS val=9
	_SC_PRIORITY_SCHEDULING val=10
	_SC_TIMERS val=11
	_SC_ASYNCHRONOUS_IO val=12
	_SC_PRIORITIZED_IO val=13
	_SC_SYNCHRONIZED_IO val=14
	_SC_FSYNC val=15
	_SC_MAPPED_FILES val=16
	_SC_MEMLOCK val=17
	_SC_MEMLOCK_RANGE val=18
	_SC_MEMORY_PROTECTION val=19
	_SC_MESSAGE_PASSING val=20
	_SC_SEMAPHORES val=21
	_SC_SHARED_MEMORY_OBJECTS val=22
	_SC_AIO_LISTIO_MAX val=23
	_SC_AIO_MAX val=24
	_SC_AIO_PRIO_DELTA_MAX val=25
	_SC_DELAYTIMER_MAX val=26
	_SC_MQ_OPEN_MAX val=27
	_SC_MQ_PRIO_MAX val=28
	_SC_VERSION val=29
	_SC_PAGESIZE val=30
	_SC_RTSIG_MAX val=31
	_SC_SEM_NSEMS_MAX val=32
	_SC_SEM_VALUE_MAX val=33
	_SC_SIGQUEUE_MAX val=34
	_SC_TIMER_MAX val=35
	_SC_BC_BASE_MAX val=36
	_SC_BC_DIM_MAX val=37
	_SC_BC_SCALE_MAX val=38
	_SC_BC_STRING_MAX val=39
	_SC_COLL_WEIGHTS_MAX val=40
	_SC_EQUIV_CLASS_MAX val=41
	_SC_EXPR_NEST_MAX val=42
	_SC_LINE_MAX val=43
	_SC_RE_DUP_MAX val=44
	_SC_CHARCLASS_NAME_MAX val=45
	_SC_2_VERSION val=46
	_SC_2_C_BIND val=47
	_SC_2_C_DEV val=48
	_SC_2_FORT_DEV val=49
	_SC_2_FORT_RUN val=50
	_SC_2_SW_DEV val=51
	_SC_2_LOCALEDEF val=52
	_SC_PII val=53
	_SC_PII_XTI val=54
	_SC_PII_SOCKET val=55
	_SC_PII_INTERNET val=56
	_SC_PII_OSI val=57
	_SC_POLL val=58
	_SC_SELECT val=59
	_SC_UIO_MAXIOV val=60
	_SC_IOV_MAX val=60
	_SC_PII_INTERNET_STREAM val=61
	_SC_PII_INTERNET_DGRAM val=62
	_SC_PII_OSI_COTS val=63
	_SC_PII_OSI_CLTS val=64
	_SC_PII_OSI_M val=65
	_SC_T_IOV_MAX val=66
	_SC_THREADS val=67
	_SC_THREAD_SAFE_FUNCTIONS val=68
	_SC_GETGR_R_SIZE_MAX val=69
	_SC_GETPW_R_SIZE_MAX val=70
	_SC_LOGIN_NAME_MAX val=71
	_SC_TTY_NAME_MAX val=72
	_SC_THREAD_DESTRUCTOR_ITERATIONS val=73
	_SC_THREAD_KEYS_MAX val=74
	_SC_THREAD_STACK_MIN val=75
	_SC_THREAD_THREADS_MAX val=76
	_SC_THREAD_ATTR_STACKADDR val=77
	_SC_THREAD_ATTR_STACKSIZE val=78
	_SC_THREAD_PRIORITY_SCHEDULING val=79
	_SC_THREAD_PRIO_INHERIT val=80
	_SC_THREAD_PRIO_PROTECT val=81
	_SC_THREAD_PROCESS_SHARED val=82
	_SC_NPROCESSORS_CONF val=83
	_SC_NPROCESSORS_ONLN val=84
	_SC_PHYS_PAGES val=85
	_SC_AVPHYS_PAGES val=86
	_SC_ATEXIT_MAX val=87
	_SC_PASS_MAX val=88
	_SC_XOPEN_VERSION val=89
	_SC_XOPEN_XCU_VERSION val=90
	_SC_XOPEN_UNIX val=91
	_SC_XOPEN_CRYPT val=92
	_SC_XOPEN_ENH_I18N val=93
	_SC_XOPEN_SHM val=94
	_SC_2_CHAR_TERM val=95
	_SC_2_C_VERSION val=96
	_SC_2_UPE val=97
	_SC_XOPEN_XPG2 val=98
	_SC_XOPEN_XPG3 val=99
	_SC_XOPEN_XPG4 val=100
	_SC_CHAR_BIT val=101
	_SC_CHAR_MAX val=102
	_SC_CHAR_MIN val=103
	_SC_INT_MAX val=104
	_SC_INT_MIN val=105
	_SC_LONG_BIT val=106
	_SC_WORD_BIT val=107
	_SC_MB_LEN_MAX val=108
	_SC_NZERO val=109
	_SC_SSIZE_MAX val=110
	_SC_SCHAR_MAX val=111
	_SC_SCHAR_MIN val=112
	_SC_SHRT_MAX val=113
	_SC_SHRT_MIN val=114
	_SC_UCHAR_MAX val=115
	_SC_UINT_MAX val=116
	_SC_ULONG_MAX val=117
	_SC_USHRT_MAX val=118
	_SC_NL_ARGMAX val=119
	_SC_NL_LANGMAX val=120
	_SC_NL_MSGMAX val=121
	_SC_NL_NMAX val=122
	_SC_NL_SETMAX val=123
	_SC_NL_TEXTMAX val=124
	_SC_XBS5_ILP32_OFF32 val=125
	_SC_XBS5_ILP32_OFFBIG val=126
	_SC_XBS5_LP64_OFF64 val=127
	_SC_XBS5_LPBIG_OFFBIG val=128
	_SC_XOPEN_LEGACY val=129
	_SC_XOPEN_REALTIME val=130
	_SC_XOPEN_REALTIME_THREADS val=131
	_SC_ADVISORY_INFO val=132
	_SC_BARRIERS val=133
	_SC_BASE val=134
	_SC_C_LANG_SUPPORT val=135
	_SC_C_LANG_SUPPORT_R val=136
	_SC_CLOCK_SELECTION val=137
	_SC_CPUTIME val=138
	_SC_THREAD_CPUTIME val=139
	_SC_DEVICE_IO val=140
	_SC_DEVICE_SPECIFIC val=141
	_SC_DEVICE_SPECIFIC_R val=142
	_SC_FD_MGMT val=143
	_SC_FIFO val=144
	_SC_PIPE val=145
	_SC_FILE_ATTRIBUTES val=146
	_SC_FILE_LOCKING val=147
	_SC_FILE_SYSTEM val=148
	_SC_MONOTONIC_CLOCK val=149
	_SC_MULTI_PROCESS val=150
	_SC_SINGLE_PROCESS val=151
	_SC_NETWORKING val=152
	_SC_READER_WRITER_LOCKS val=153
	_SC_SPIN_LOCKS val=154
	_SC_REGEXP val=155
	_SC_REGEX_VERSION val=156
	_SC_SHELL val=157
	_SC_SIGNALS val=158
	_SC_SPAWN val=159
	_SC_SPORADIC_SERVER val=160
	_SC_THREAD_SPORADIC_SERVER val=161
	_SC_SYSTEM_DATABASE val=162
	_SC_SYSTEM_DATABASE_R val=163
	_SC_TIMEOUTS val=164
	_SC_TYPED_MEMORY_OBJECTS val=165
	_SC_USER_GROUPS val=166
	_SC_USER_GROUPS_R val=167
	_SC_2_PBS val=168
	_SC_2_PBS_ACCOUNTING val=169
	_SC_2_PBS_LOCATE val=170
	_SC_2_PBS_MESSAGE val=171
	_SC_2_PBS_TRACK val=172
	_SC_SYMLOOP_MAX val=173
	_SC_STREAMS val=174
	_SC_2_PBS_CHECKPOINT val=175
	_SC_V6_ILP32_OFF32 val=176
	_SC_V6_ILP32_OFFBIG val=177
	_SC_V6_LP64_OFF64 val=178
	_SC_V6_LPBIG_OFFBIG val=179
	_SC_HOST_NAME_MAX val=180
	_SC_TRACE val=181
	_SC_TRACE_EVENT_FILTER val=182
	_SC_TRACE_INHERIT val=183
	_SC_TRACE_LOG val=184
	_SC_LEVEL1_ICACHE_SIZE val=185
	_SC_LEVEL1_ICACHE_ASSOC val=186
	_SC_LEVEL1_ICACHE_LINESIZE val=187
	_SC_LEVEL1_DCACHE_SIZE val=188
	_SC_LEVEL1_DCACHE_ASSOC val=189
	_SC_LEVEL1_DCACHE_LINESIZE val=190
	_SC_LEVEL2_CACHE_SIZE val=191
	_SC_LEVEL2_CACHE_ASSOC val=192
	_SC_LEVEL2_CACHE_LINESIZE val=193
	_SC_LEVEL3_CACHE_SIZE val=194
	_SC_LEVEL3_CACHE_ASSOC val=195
	_SC_LEVEL3_CACHE_LINESIZE val=196
	_SC_LEVEL4_CACHE_SIZE val=197
	_SC_LEVEL4_CACHE_ASSOC val=198
	_SC_LEVEL4_CACHE_LINESIZE val=199
	_SC_IPV6 val=235
	_SC_RAW_SOCKETS val=236
	_SC_V7_ILP32_OFF32 val=237
	_SC_V7_ILP32_OFFBIG val=238
	_SC_V7_LP64_OFF64 val=239
	_SC_V7_LPBIG_OFFBIG val=240
	_SC_SS_REPL_MAX val=241
	_SC_TRACE_EVENT_NAME_MAX val=242
	_SC_TRACE_NAME_MAX val=243
	_SC_TRACE_SYS_MAX val=244
	_SC_TRACE_USER_EVENT_MAX val=245
	_SC_XOPEN_STREAMS val=246
	_SC_THREAD_ROBUST_PRIO_INHERIT val=247
	_SC_THREAD_ROBUST_PRIO_PROTECT val=248
	_SC_MINSIGSTKSZ val=249
	_SC_SIGSTKSZ val=250
[104] FWD btf_ext struct
[105] PTR (anon) type_id=104
[106] INT _Bool size=1 nr_bits=8 encoding=BOOL
[107] INT long double size=16 nr_bits=128 encoding=(none)
[108] ENUM libbpf_print_level size=4
	LIBBPF_WARN val=0
	LIBBPF_INFO val=1
	LIBBPF_DEBUG val=2
[109] TYPEDEF libbpf_print_fn_t type_id=110
[110] PTR (anon) type_id=111
[111] FUNC_PROTO (anon) return=16 args=(108 (null), 44 (null), 46 (null))
[112] STRUCT _obstack_chunk size=24
	limit type_id=26 bits_offset=0
	prev type_id=113 bits_offset=64
	contents type_id=30 bits_offset=128
[113] PTR (anon) type_id=112
[114] UNION (anon) size=8
	tempint type_id=20 bits_offset=0
	tempptr type_id=24 bits_offset=0
[115] STRUCT obstack size=88
	chunk_size type_id=20 bits_offset=0
	chunk type_id=113 bits_offset=64
	object_base type_id=26 bits_offset=128
	next_free type_id=26 bits_offset=192
	chunk_limit type_id=26 bits_offset=256
	temp type_id=114 bits_offset=320
	alignment_mask type_id=16 bits_offset=384
	chunkfun type_id=117 bits_offset=448
	freefun type_id=119 bits_offset=512
	extra_arg type_id=24 bits_offset=576
	use_extra_arg type_id=9 bitfield_size=1 bits_offset=640
	maybe_empty_object type_id=9 bitfield_size=1 bits_offset=641
	alloc_failed type_id=9 bitfield_size=1 bits_offset=642
[116] FUNC_PROTO (anon) return=113 args=(24 (null), 20 (null))
[117] PTR (anon) type_id=116
[118] FUNC_PROTO (anon) return=0 args=(24 (null), 113 (null))
[119] PTR (anon) type_id=118
[120] FUNC_PROTO (anon) return=0 args=(void)
[121] PTR (anon) type_id=120
[122] TYPEDEF Elf type_id=123
[123] FWD Elf struct
[124] TYPEDEF Dwfl_Module type_id=125
[125] FWD Dwfl_Module struct
[126] PTR (anon) type_id=124
[127] PTR (anon) type_id=122
[128] STRUCT rb_node size=24
	rb_parent_color type_id=3 bits_offset=0
	rb_right type_id=130 bits_offset=64
	rb_left type_id=130 bits_offset=128
[129] CONST (anon) type_id=128
[130] PTR (anon) type_id=128
[131] STRUCT rb_root size=8
	rb_node type_id=130 bits_offset=0
[132] CONST (anon) type_id=131
[133] STRUCT list_head size=16
	next type_id=135 bits_offset=0
	prev type_id=135 bits_offset=64
[134] CONST (anon) type_id=133
[135] PTR (anon) type_id=133
[136] STRUCT hlist_node size=16
	next type_id=137 bits_offset=0
	pprev type_id=138 bits_offset=64
[137] PTR (anon) type_id=136
[138] PTR (anon) type_id=137
[139] ENUM load_steal_kind size=4
	LSK__KEEPIT val=0
	LSK__DELETE val=1
	LSK__STOP_LOADING val=2
[140] TYPEDEF type_id_t type_id=84
[141] CONST (anon) type_id=140
[142] STRUCT conf_load size=96
	steal type_id=149 bits_offset=0
	thread_exit type_id=151 bits_offset=64
	cookie type_id=24 bits_offset=128
	format_path type_id=26 bits_offset=192
	nr_jobs type_id=16 bits_offset=256
	extra_dbg_info type_id=106 bits_offset=288
	use_obstack type_id=106 bits_offset=296
	fixup_silly_bitfields type_id=106 bits_offset=304
	get_addr_info type_id=106 bits_offset=312
	ignore_alignment_attr type_id=106 bits_offset=320
	ignore_inline_expansions type_id=106 bits_offset=328
	ignore_labels type_id=106 bits_offset=336
	ptr_table_stats type_id=106 bits_offset=344
	skip_encoding_btf_decl_tag type_id=106 bits_offset=352
	skip_missing type_id=106 bits_offset=360
	skip_encoding_btf_type_tag type_id=106 bits_offset=368
	skip_encoding_btf_enum64 type_id=106 bits_offset=376
	btf_gen_optimized type_id=106 bits_offset=384
	skip_encoding_btf_inconsistent_proto type_id=106 bits_offset=392
	hashtable_bits type_id=80 bits_offset=400
	max_hashtable_bits type_id=80 bits_offset=408
	kabi_prefix_len type_id=82 bits_offset=416
	kabi_prefix type_id=44 bits_offset=448
	base_btf type_id=153 bits_offset=512
	conf_fprintf type_id=156 bits_offset=576
	threads_prepare type_id=158 bits_offset=640
	threads_collect type_id=160 bits_offset=704
[143] CONST (anon) type_id=142
[144] FUNC_PROTO (anon) return=139 args=(145 (null), 148 (null), 24 (null))
[145] PTR (anon) type_id=146
[146] STRUCT cu size=344
	node type_id=133 bits_offset=0
	tags type_id=133 bits_offset=128
	tool_list type_id=133 bits_offset=256
	types_table type_id=162 bits_offset=384
	functions_table type_id=162 bits_offset=512
	tags_table type_id=162 bits_offset=640
	functions type_id=131 bits_offset=768
	name type_id=26 bits_offset=832
	filename type_id=26 bits_offset=896
	priv type_id=24 bits_offset=960
	dfops type_id=182 bits_offset=1024
	elf type_id=127 bits_offset=1088
	dwfl type_id=126 bits_offset=1152
	obstack type_id=115 bits_offset=1216
	cached_symtab_nr_entries type_id=84 bits_offset=1920
	use_obstack type_id=106 bits_offset=1952
	addr_size type_id=80 bits_offset=1960
	extra_dbg_info type_id=80 bitfield_size=1 bits_offset=1968
	has_addr_info type_id=80 bitfield_size=1 bits_offset=1969
	uses_global_strings type_id=80 bitfield_size=1 bits_offset=1970
	little_endian type_id=80 bitfield_size=1 bits_offset=1971
	nr_register_params type_id=80 bitfield_size=0 bits_offset=1976
	register_params type_id=183 bitfield_size=0 bits_offset=1984
	language type_id=82 bitfield_size=0 bits_offset=2240
	nr_inline_expansions type_id=3 bitfield_size=0 bits_offset=2304
	size_inline_expansions type_id=1 bitfield_size=0 bits_offset=2368
	nr_functions_changed type_id=84 bitfield_size=0 bits_offset=2432
	nr_structures_changed type_id=84 bitfield_size=0 bits_offset=2464
	max_len_changed_item type_id=1 bitfield_size=0 bits_offset=2496
	function_bytes_added type_id=1 bitfield_size=0 bits_offset=2560
	function_bytes_removed type_id=1 bitfield_size=0 bits_offset=2624
	build_id_len type_id=16 bitfield_size=0 bits_offset=2688
	build_id type_id=184 bitfield_size=0 bits_offset=2720
[147] CONST (anon) type_id=146
[148] PTR (anon) type_id=142
[149] PTR (anon) type_id=144
[150] FUNC_PROTO (anon) return=16 args=(148 (null), 24 (null))
[151] PTR (anon) type_id=150
[152] FWD btf struct
[153] PTR (anon) type_id=152
[154] STRUCT conf_fprintf size=88
	prefix type_id=44 bits_offset=0
	suffix type_id=44 bits_offset=64
	type_spacing type_id=78 bits_offset=128
	name_spacing type_id=78 bits_offset=160
	base_offset type_id=84 bits_offset=192
	count type_id=84 bits_offset=224
	cachelinep type_id=161 bits_offset=256
	seek_bytes type_id=44 bits_offset=320
	size_bytes type_id=44 bits_offset=384
	header_type type_id=44 bits_offset=448
	range type_id=44 bits_offset=512
	skip type_id=84 bits_offset=576
	cacheline_size type_id=82 bits_offset=608
	indent type_id=80 bits_offset=624
	expand_types type_id=80 bitfield_size=1 bits_offset=632
	expand_pointers type_id=80 bitfield_size=1 bits_offset=633
	rel_offset type_id=80 bitfield_size=1 bits_offset=634
	emit_stats type_id=80 bitfield_size=1 bits_offset=635
	suppress_comments type_id=80 bitfield_size=1 bits_offset=636
	has_alignment_info type_id=80 bitfield_size=1 bits_offset=637
	suppress_aligned_attribute type_id=80 bitfield_size=1 bits_offset=638
	suppress_offset_comment type_id=80 bitfield_size=1 bits_offset=639
	suppress_force_paddings type_id=80 bitfield_size=1 bits_offset=640
	suppress_packed type_id=80 bitfield_size=1 bits_offset=641
	show_decl_info type_id=80 bitfield_size=1 bits_offset=642
	show_only_data_members type_id=80 bitfield_size=1 bits_offset=643
	no_semicolon type_id=80 bitfield_size=1 bits_offset=644
	show_first_biggest_size_base_type_member type_id=80 bitfield_size=1 bits_offset=645
	flat_arrays type_id=80 bitfield_size=1 bits_offset=646
	first_member type_id=80 bitfield_size=1 bits_offset=647
	last_member type_id=80 bitfield_size=1 bits_offset=648
	union_member type_id=80 bitfield_size=1 bits_offset=649
	no_parm_names type_id=80 bitfield_size=1 bits_offset=650
	classes_as_structs type_id=80 bitfield_size=1 bits_offset=651
	hex_fmt type_id=80 bitfield_size=1 bits_offset=652
	strip_inline type_id=80 bitfield_size=1 bits_offset=653
	skip_emitting_atomic_typedefs type_id=80 bitfield_size=1 bits_offset=654
	skip_emitting_errors type_id=80 bitfield_size=1 bits_offset=655
	skip_emitting_modifier type_id=80 bitfield_size=1 bits_offset=656
[155] CONST (anon) type_id=154
[156] PTR (anon) type_id=154
[157] FUNC_PROTO (anon) return=16 args=(148 (null), 16 (null), 75 (null))
[158] PTR (anon) type_id=157
[159] FUNC_PROTO (anon) return=16 args=(148 (null), 16 (null), 75 (null), 16 (null))
[160] PTR (anon) type_id=159
[161] PTR (anon) type_id=84
[162] STRUCT ptr_table size=16
	entries type_id=75 bits_offset=0
	nr_entries type_id=84 bits_offset=64
	allocated_entries type_id=84 bits_offset=96
[163] STRUCT debug_fmt_ops size=72
	name type_id=44 bits_offset=0
	init type_id=165 bits_offset=64
	exit type_id=121 bits_offset=128
	load_file type_id=169 bits_offset=192
	tag__decl_file type_id=175 bits_offset=256
	tag__decl_line type_id=177 bits_offset=320
	tag__orig_id type_id=179 bits_offset=384
	cu__delete type_id=181 bits_offset=448
	has_alignment_info type_id=106 bits_offset=512
[164] FUNC_PROTO (anon) return=16 args=(void)
[165] PTR (anon) type_id=164
[166] FUNC_PROTO (anon) return=16 args=(167 (null), 148 (null), 44 (null))
[167] PTR (anon) type_id=168
[168] FWD cus struct
[169] PTR (anon) type_id=166
[170] FUNC_PROTO (anon) return=44 args=(171 (null), 174 (null))
[171] PTR (anon) type_id=173
[172] STRUCT tag size=40
	node type_id=133 bits_offset=0
	type type_id=140 bits_offset=128
	tag type_id=82 bits_offset=160
	visited type_id=106 bits_offset=176
	top_level type_id=106 bits_offset=184
	has_btf_type_tag type_id=106 bits_offset=192
	recursivity_level type_id=82 bits_offset=208
	priv type_id=24 bits_offset=256
[173] CONST (anon) type_id=172
[174] PTR (anon) type_id=147
[175] PTR (anon) type_id=170
[176] FUNC_PROTO (anon) return=84 args=(171 (null), 174 (null))
[177] PTR (anon) type_id=176
[178] FUNC_PROTO (anon) return=87 args=(171 (null), 174 (null))
[179] PTR (anon) type_id=178
[180] FUNC_PROTO (anon) return=0 args=(145 (null))
[181] PTR (anon) type_id=180
[182] PTR (anon) type_id=163
[183] ARRAY (anon) type_id=16 index_type_id=16 nr_elems=8
[184] ARRAY (anon) type_id=6 index_type_id=16 nr_elems=0
[185] STRUCT tag_cu size=16
	tag type_id=186 bits_offset=0
	cu type_id=145 bits_offset=64
[186] PTR (anon) type_id=172
[187] STRUCT namespace size=88
	tag type_id=172 bits_offset=0
	name type_id=44 bits_offset=320
	nr_tags type_id=82 bits_offset=384
	shared_tags type_id=80 bits_offset=400
	tags type_id=133 bits_offset=448
	annots type_id=133 bits_offset=576
[188] CONST (anon) type_id=187
[189] STRUCT ip_tag size=48
	tag type_id=172 bits_offset=0
	addr type_id=86 bits_offset=320
[190] STRUCT lexblock size=80
	ip type_id=189 bits_offset=0
	tags type_id=133 bits_offset=384
	size type_id=84 bits_offset=512
	nr_inline_expansions type_id=82 bits_offset=544
	nr_labels type_id=82 bits_offset=560
	nr_variables type_id=82 bits_offset=576
	nr_lexblocks type_id=82 bits_offset=592
	size_inline_expansions type_id=84 bits_offset=608
[191] STRUCT ftype size=64
	tag type_id=172 bits_offset=0
	parms type_id=133 bits_offset=320
	nr_parms type_id=82 bits_offset=448
	unspec_parms type_id=80 bitfield_size=1 bits_offset=464
	optimized_parms type_id=80 bitfield_size=1 bits_offset=465
	unexpected_reg type_id=80 bitfield_size=1 bits_offset=466
	processed type_id=80 bitfield_size=1 bits_offset=467
	inconsistent_proto type_id=80 bitfield_size=1 bits_offset=468
[192] UNION (anon) size=16
	tool_node type_id=133 bits_offset=0
	tool_hnode type_id=136 bits_offset=0
[193] STRUCT function size=264
	proto type_id=191 bits_offset=0
	lexblock type_id=190 bits_offset=512
	rb_node type_id=128 bits_offset=1152
	name type_id=44 bits_offset=1344
	linkage_name type_id=44 bits_offset=1408
	alias type_id=44 bits_offset=1472
	cu_total_size_inline_expansions type_id=84 bits_offset=1536
	cu_total_nr_inline_expansions type_id=82 bits_offset=1568
	inlined type_id=80 bitfield_size=2 bits_offset=1584
	abstract_origin type_id=80 bitfield_size=1 bits_offset=1586
	external type_id=80 bitfield_size=1 bits_offset=1587
	accessibility type_id=80 bitfield_size=2 bits_offset=1588
	virtuality type_id=80 bitfield_size=2 bits_offset=1590
	declaration type_id=80 bitfield_size=1 bits_offset=1592
	btf type_id=80 bitfield_size=1 bits_offset=1593
	vtable_entry type_id=78 bitfield_size=0 bits_offset=1600
	vtable_node type_id=133 bitfield_size=0 bits_offset=1664
	annots type_id=133 bitfield_size=0 bits_offset=1792
	(anon) type_id=192 bitfield_size=0 bits_offset=1920
	priv type_id=24 bitfield_size=0 bits_offset=2048
[194] STRUCT class_member size=96
	tag type_id=172 bits_offset=0
	name type_id=44 bits_offset=320
	bit_offset type_id=84 bits_offset=384
	bit_size type_id=84 bits_offset=416
	byte_offset type_id=84 bits_offset=448
	byte_size type_id=1 bits_offset=512
	bitfield_offset type_id=77 bits_offset=576
	bitfield_size type_id=80 bits_offset=584
	bit_hole type_id=80 bits_offset=592
	bitfield_end type_id=80 bitfield_size=1 bits_offset=600
	const_value type_id=86 bitfield_size=0 bits_offset=640
	alignment type_id=84 bitfield_size=0 bits_offset=704
	visited type_id=80 bitfield_size=1 bits_offset=736
	is_static type_id=80 bitfield_size=1 bits_offset=737
	has_bit_offset type_id=80 bitfield_size=1 bits_offset=738
	accessibility type_id=80 bitfield_size=2 bits_offset=739
	virtuality type_id=80 bitfield_size=2 bits_offset=741
	hole type_id=82 bitfield_size=0 bits_offset=752
[195] CONST (anon) type_id=194
[196] STRUCT tag_cu_node size=32
	node type_id=133 bits_offset=0
	tc type_id=185 bits_offset=128
[197] STRUCT type size=176
	namespace type_id=187 bits_offset=0
	node type_id=133 bits_offset=704
	size type_id=84 bits_offset=832
	size_diff type_id=78 bits_offset=864
	nr_static_members type_id=82 bits_offset=896
	nr_members type_id=82 bits_offset=912
	alignment type_id=84 bits_offset=928
	sizeof_member type_id=199 bits_offset=960
	type_member type_id=199 bits_offset=1024
	filter type_id=201 bits_offset=1088
	type_enum type_id=133 bits_offset=1152
	member_prefix type_id=26 bits_offset=1280
	member_prefix_len type_id=82 bits_offset=1344
	max_tag_name_len type_id=82 bits_offset=1360
	natural_alignment type_id=82 bits_offset=1376
	suffix_disambiguation type_id=80 bits_offset=1392
	packed_attributes_inferred type_id=80 bitfield_size=1 bits_offset=1400
	declaration type_id=80 bitfield_size=1 bits_offset=1401
	definition_emitted type_id=80 bitfield_size=1 bits_offset=1402
	fwd_decl_emitted type_id=80 bitfield_size=1 bits_offset=1403
	resized type_id=80 bitfield_size=1 bits_offset=1404
	is_signed_enum type_id=80 bitfield_size=1 bits_offset=1405
[198] CONST (anon) type_id=197
[199] PTR (anon) type_id=194
[200] STRUCT class_member_filter size=16
	left type_id=199 bits_offset=0
	right type_id=86 bits_offset=64
[201] PTR (anon) type_id=200
[202] STRUCT class size=216
	type type_id=197 bits_offset=0
	vtable type_id=133 bits_offset=1408
	nr_vtable_entries type_id=82 bits_offset=1536
	nr_holes type_id=80 bits_offset=1552
	nr_bit_holes type_id=80 bits_offset=1560
	pre_hole type_id=82 bits_offset=1568
	padding type_id=82 bits_offset=1584
	pre_bit_hole type_id=80 bits_offset=1600
	bit_padding type_id=80 bits_offset=1608
	holes_searched type_id=106 bits_offset=1616
	is_packed type_id=106 bits_offset=1624
	priv type_id=24 bits_offset=1664
[203] CONST (anon) type_id=202
[204] STRUCT base_type size=72
	tag type_id=172 bits_offset=0
	name type_id=44 bits_offset=320
	node type_id=133 bits_offset=384
	bit_size type_id=82 bits_offset=512
	name_has_encoding type_id=80 bitfield_size=1 bits_offset=528
	is_signed type_id=80 bitfield_size=1 bits_offset=529
	is_bool type_id=80 bitfield_size=1 bits_offset=530
	is_varargs type_id=80 bitfield_size=1 bits_offset=531
	float_type type_id=80 bitfield_size=4 bits_offset=532
	definition_emitted type_id=80 bitfield_size=1 bits_offset=536
[205] CONST (anon) type_id=204
[206] STRUCT array_type size=56
	tag type_id=172 bits_offset=0
	nr_entries type_id=161 bits_offset=320
	dimensions type_id=80 bits_offset=384
	is_vector type_id=106 bits_offset=392
[207] STRUCT enumerator size=72
	tag type_id=172 bits_offset=0
	name type_id=44 bits_offset=320
	value type_id=86 bits_offset=384
	type_enum type_id=185 bits_offset=448
[208] CONST (anon) type_id=207
[209] ARRAY (anon) type_id=29 index_type_id=16 nr_elems=0
[210] CONST (anon) type_id=209
[211] STRUCT type_emissions size=56
	definitions type_id=133 bits_offset=0
	base_type_definitions type_id=133 bits_offset=128
	fwd_decls type_id=133 bits_offset=256
	conf_fprintf type_id=156 bits_offset=384
[212] FWD btf_encoder struct
[213] PTR (anon) type_id=212
[214] STRUCT structure size=72
	node type_id=133 bits_offset=0
	rb_node type_id=128 bits_offset=128
	class type_id=215 bits_offset=320
	cu type_id=145 bits_offset=384
	id type_id=84 bits_offset=448
	nr_files type_id=84 bits_offset=480
	nr_methods type_id=84 bits_offset=512
[215] PTR (anon) type_id=202
[216] STRUCT (anon) size=24
	str type_id=26 bits_offset=0
	entries type_id=52 bits_offset=64
	nr_entries type_id=16 bits_offset=128
	exclude type_id=106 bits_offset=160
[217] FUNC_PROTO (anon) return=0 args=(218 (null))
[218] PTR (anon) type_id=214
[219] PTR (anon) type_id=217
[220] FUNC_PROTO (anon) return=0 args=(215 (null), 145 (null), 84 (null))
[221] PTR (anon) type_id=220
[222] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=128
[223] FUNC_PROTO (anon) return=0 args=(48 (null), 60 (null))
[224] PTR (anon) type_id=223
[225] CONST (anon) type_id=224
[226] ARRAY (anon) type_id=56 index_type_id=16 nr_elems=79
[227] CONST (anon) type_id=226
[228] ARRAY (anon) type_id=29 index_type_id=16 nr_elems=5
[229] CONST (anon) type_id=228
[230] STRUCT type_instance size=24
	type type_id=231 bits_offset=0
	cu type_id=145 bits_offset=64
	read_already type_id=106 bits_offset=128
	instance type_id=232 bits_offset=136
[231] PTR (anon) type_id=197
[232] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=0
[233] STRUCT prototype size=80
	node type_id=133 bits_offset=0
	class type_id=186 bits_offset=128
	cu type_id=145 bits_offset=192
	type type_id=44 bits_offset=256
	type_enum type_id=44 bits_offset=320
	size type_id=44 bits_offset=384
	range type_id=44 bits_offset=448
	filter type_id=26 bits_offset=512
	nr_args type_id=82 bits_offset=576
	type_enum_resolved type_id=106 bits_offset=592
	name type_id=234 bits_offset=600
[234] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=0
[235] PTR (anon) type_id=230
[236] STRUCT thread_data size=16
	btf type_id=153 bits_offset=0
	encoder type_id=213 bits_offset=64
[237] PTR (anon) type_id=105
[238] PTR (anon) type_id=143
[239] PTR (anon) type_id=140
[240] PTR (anon) type_id=51
[241] PTR (anon) type_id=198
[242] PTR (anon) type_id=155
[243] PTR (anon) type_id=211
[244] PTR (anon) type_id=205
[245] PTR (anon) type_id=203
[246] PTR (anon) type_id=131
[247] PTR (anon) type_id=129
[248] PTR (anon) type_id=132
[249] PTR (anon) type_id=94
[250] PTR (anon) type_id=233
[251] PTR (anon) type_id=134
[252] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=1024
[253] PTR (anon) type_id=236
[254] PTR (anon) type_id=253
[255] PTR (anon) type_id=196
[256] PTR (anon) type_id=145
[257] PTR (anon) type_id=207
[258] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=4096
[259] PTR (anon) type_id=206
[260] PTR (anon) type_id=80
[261] ARRAY (anon) type_id=29 index_type_id=16 nr_elems=30
[262] CONST (anon) type_id=261
[263] PTR (anon) type_id=193
[264] PTR (anon) type_id=204
[265] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=64
[266] ARRAY (anon) type_id=29 index_type_id=16 nr_elems=21
[267] CONST (anon) type_id=266
[268] ARRAY (anon) type_id=29 index_type_id=16 nr_elems=17
[269] CONST (anon) type_id=268
[270] PTR (anon) type_id=130
[271] PTR (anon) type_id=106
[272] PTR (anon) type_id=208
[273] PTR (anon) type_id=188
[274] PTR (anon) type_id=195
[275] PTR (anon) type_id=191
[276] PTR (anon) type_id=187
[277] FUNC_PROTO (anon) return=16 args=(16 argc, 73 argv)
[278] FUNC main type_id=277
[279] FUNC_PROTO (anon) return=16 args=(void)
[280] FUNC populate_class_names type_id=279
[281] FUNC_PROTO (anon) return=16 args=(44 s)
[282] FUNC add_class_name_entry type_id=281
[283] FUNC_PROTO (anon) return=16 args=(135 prototypes, 44 filename)
[284] FUNC prototypes__load type_id=283
[285] FUNC_PROTO (anon) return=16 args=(135 prototypes, 44 entry)
[286] FUNC prototypes__add type_id=285
[287] FUNC_PROTO (anon) return=139 args=(145 cu, 148 conf_load, 24 thr_data)
[288] FUNC pahole_stealer type_id=287
[289] FUNC_PROTO (anon) return=16 args=(148 conf, 16 nr_threads, 75 thr_data, 16 error)
[290] FUNC pahole_threads_collect type_id=289
[291] FUNC_PROTO (anon) return=16 args=(148 conf, 24 thr_data)
[292] FUNC pahole_thread_exit type_id=291
[293] FUNC_PROTO (anon) return=16 args=(148 conf, 16 nr_threads, 75 thr_data)
[294] FUNC pahole_threads_prepare type_id=293
[295] FUNC_PROTO (anon) return=16 args=(231 type, 145 cu, 44 type_enum)
[296] FUNC type__find_type_enum type_id=295
[297] FUNC_PROTO (anon) return=16 args=(231 type, 186 type_enum, 145 cu)
[298] FUNC type__add_type_enum type_id=297
[299] FUNC_PROTO (anon) return=255 args=(186 tag, 145 cu)
[300] FUNC tag_cu_node__new type_id=299
[301] FUNC_PROTO (anon) return=250 args=(44 expression)
[302] FUNC prototype__new type_id=301
[303] FUNC_PROTO (anon) return=201 args=(231 type, 26 sfilter)
[304] FUNC class_member_filter__new type_id=303
[305] FUNC_PROTO (anon) return=16 args=(201 filter, 231 type, 26 sfilter)
[306] FUNC class_member_filter__parse type_id=305
[307] FUNC_PROTO (anon) return=16 args=(250 prototype, 235 header, 48 input, 48 output)
[308] FUNC prototype__stdio_fprintf_value type_id=307
[309] FUNC_PROTO (anon) return=79 args=(235 instance, 48 fp)
[310] FUNC type__instance_read_once type_id=309
[311] FUNC_PROTO (anon) return=79 args=(235 instance, 44 member_name_orig)
[312] FUNC type_instance__int_value type_id=311
[313] FUNC_PROTO (anon) return=0 args=(235 instance)
[314] FUNC type_instance__delete type_id=313
[315] FUNC_PROTO (anon) return=235 args=(231 type, 145 cu)
[316] FUNC type_instance__new type_id=315
[317] FUNC_PROTO (anon) return=186 args=(186 tag, 256 cup, 24 instance)
[318] FUNC tag__real_type type_id=317
[319] FUNC_PROTO (anon) return=106 args=(186 tag, 24 instance)
[320] FUNC type__filter_value type_id=319
[321] FUNC_PROTO (anon) return=86 args=(186 tag, 16 _sizeof, 24 instance)
[322] FUNC tag__real_sizeof type_id=321
[323] FUNC_PROTO (anon) return=16 args=(48 fp, 47 offset)
[324] FUNC pipe_seek type_id=323
