  0s autopkgtest: DBG: testbed init
  0s autopkgtest [03:26:11]: starting date and time: 2024-07-18 03:26:11+0800
  0s autopkgtest [03:26:11]: version @version@
  0s autopkgtest [03:26:11]: host lili; command line: /usr/bin/autopkgtest dwarves_1.25-ok2.dsc -o /home/hachi/openkylin_test/sharefolder/results/dwarves -d -B -- schroot openkylin-2
  0s autopkgtest: DBG: got reply from testbed: ok
  0s autopkgtest: DBG: testbed open, scratch=None
  0s autopkgtest: DBG: sending command to testbed: open
  1s autopkgtest: DBG: got reply from testbed: ok /tmp/autopkgtest.4tX8lo
  1s autopkgtest: DBG: sending command to testbed: print-execute-command
  1s autopkgtest: DBG: got reply from testbed: ok schroot,--run-session,--quiet,--directory%3D/,--chroot,openkylin-2-9db12ead-a5cd-4c0c-aed1-26839cb1b60c,--user%3Droot,--
  1s autopkgtest: DBG: sending command to testbed: capabilities
  1s autopkgtest: DBG: got reply from testbed: ok revert root-on-testbed downtmp-host=/var/run/schroot/mount/openkylin-2-9db12ead-a5cd-4c0c-aed1-26839cb1b60c//tmp/autopkgtest.4tX8lo
  1s autopkgtest: DBG: testbed capabilities: ['revert', 'root-on-testbed', 'downtmp-host=/var/run/schroot/mount/openkylin-2-9db12ead-a5cd-4c0c-aed1-26839cb1b60c//tmp/autopkgtest.4tX8lo', 'has_internet']
  1s autopkgtest: DBG: testbed command ['mkdir', '-p', '/tmp/autopkgtest.4tX8lo'], kind short, sout raw, serr pipe, env []
  1s autopkgtest: DBG: testbed command exited with code 0

132s autopkgtest: DBG: got reply from testbed: ok
132s autopkgtest: DBG: testbed command ['test', '-e', '/tmp/autopkgtest.4tX8lo/build.xaK/src'], kind short, sout raw, serr raw, env []
132s autopkgtest: DBG: testbed command exited with code 0
132s autopkgtest: DBG: copydown: tb path /tmp/autopkgtest.4tX8lo/build.xaK/src already exists
132s autopkgtest [03:28:23]: test dwarf-struct-with-hole: [-----------------------
132s autopkgtest: DBG: testbed command ['su', '-s', '/bin/bash', 'root', '-c', 'set -e; exec /tmp/autopkgtest.4tX8lo/wrapper.sh --debug --artifacts=/tmp/autopkgtest.4tX8lo/dwarf-struct-with-hole-artifacts --chdir=/tmp/autopkgtest.4tX8lo/build.xaK/src --env=DEB_BUILD_OPTIONS=parallel=128 --env=DEBIAN_FRONTEND=noninteractive --env=LANG=C.UTF-8 --unset-env=LANGUAGE --unset-env=LC_ADDRESS --unset-env=LC_ALL --unset-env=LC_COLLATE --unset-env=LC_CTYPE --unset-env=LC_IDENTIFICATION --unset-env=LC_MEASUREMENT --unset-env=LC_MESSAGES --unset-env=LC_MONETARY --unset-env=LC_NAME --unset-env=LC_NUMERIC --unset-env=LC_PAPER --unset-env=LC_TELEPHONE --unset-env=LC_TIME --script-pid-file=/tmp/autopkgtest_script_pid --source-profile --stderr=/tmp/autopkgtest.4tX8lo/dwarf-struct-with-hole-stderr --stdout=/tmp/autopkgtest.4tX8lo/dwarf-struct-with-hole-stdout --tmp=/tmp/autopkgtest.4tX8lo/autopkgtest_tmp --make-executable=/tmp/autopkgtest.4tX8lo/build.xaK/src/debian/tests/dwarf-struct-with-hole -- /tmp/autopkgtest.4tX8lo/build.xaK/src/debian/tests/dwarf-struct-with-hole'], kind test, sout raw, serr raw, env []
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: creating AUTOPKGTEST_ARTIFACTS: /tmp/autopkgtest.4tX8lo/dwarf-struct-with-hole-artifacts
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: changing to directory: /tmp/autopkgtest.4tX8lo/build.xaK/src
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: setting environment: DEB_BUILD_OPTIONS=parallel=128
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: setting environment: DEBIAN_FRONTEND=noninteractive
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: setting environment: LANG=C.UTF-8
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LANGUAGE
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_ADDRESS
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_ALL
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_COLLATE
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_CTYPE
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_IDENTIFICATION
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_MEASUREMENT
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_MESSAGES
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_MONETARY
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_NAME
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_NUMERIC
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_PAPER
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_TELEPHONE
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: unsetting environment: LC_TIME
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: will create pid file: /tmp/autopkgtest_script_pid
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: pretending to be a login shell
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: will write standard error to /tmp/autopkgtest.4tX8lo/dwarf-struct-with-hole-stderr
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: will write stdout to /tmp/autopkgtest.4tX8lo/dwarf-struct-with-hole-stdout
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: creating AUTOPKGTEST_TMP: /tmp/autopkgtest.4tX8lo/autopkgtest_tmp
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: marking as executable: /tmp/autopkgtest.4tX8lo/build.xaK/src/debian/tests/dwarf-struct-with-hole
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: command to run: /tmp/autopkgtest.4tX8lo/build.xaK/src/debian/tests/dwarf-struct-with-hole
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: copying /tmp/tmp.KT8JymJabW/out to stdout and file: /tmp/autopkgtest.4tX8lo/dwarf-struct-with-hole-stdout
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: copying /tmp/tmp.KT8JymJabW/err to standard error and file: /tmp/autopkgtest.4tX8lo/dwarf-struct-with-hole-stdout
132s /tmp/autopkgtest.4tX8lo/wrapper.sh: writing script pid 354712 to /tmp/autopkgtest_script_pid
135s pahole.o: ELF 64-bit LSB relocatable, UCB RISC-V, RVC, double-float ABI, version 1 (SYSV), with debug_info, not stripped
135s The 5 biggest data structures:
135s cu	344	1
135s function	264	1
135s class	216	1
135s _IO_FILE	216	2
135s type	176	0
135s btf_encoder__new: 'pahole.o' doesn't have '.data..percpu' section
135s Found 0 per-CPU variables!
135s Found 121 functions!
135s File pahole.o:
135s [1] TYPEDEF size_t type_id=3
135s [2] CONST (anon) type_id=1
135s [3] INT long unsigned int size=8 nr_bits=64 encoding=(none)
135s [4] TYPEDEF __gnuc_va_list type_id=5
135s [5] PTR (anon) type_id=0
135s [6] INT unsigned char size=1 nr_bits=8 encoding=(none)
135s [7] INT short unsigned int size=2 nr_bits=16 encoding=(none)
135s [8] CONST (anon) type_id=7
135s [9] INT unsigned int size=4 nr_bits=32 encoding=(none)
135s [10] TYPEDEF __int8_t type_id=11
135s [11] INT signed char size=1 nr_bits=8 encoding=SIGNED
135s [12] TYPEDEF __uint8_t type_id=6
135s [13] INT short int size=2 nr_bits=16 encoding=SIGNED
135s [14] TYPEDEF __uint16_t type_id=7
135s [15] TYPEDEF __int32_t type_id=16
135s [16] INT int size=4 nr_bits=32 encoding=SIGNED
135s [17] CONST (anon) type_id=16
135s [18] TYPEDEF __uint32_t type_id=9
135s [19] TYPEDEF __int64_t type_id=20
135s [20] INT long int size=8 nr_bits=64 encoding=SIGNED
135s [21] TYPEDEF __uint64_t type_id=3
135s [22] TYPEDEF __off_t type_id=20
135s [23] TYPEDEF __off64_t type_id=20
135s [24] PTR (anon) type_id=0
135s [25] RESTRICT (anon) type_id=24
135s [26] PTR (anon) type_id=28
135s [27] RESTRICT (anon) type_id=26
135s [28] INT char size=1 nr_bits=8 encoding=(none)
135s [29] CONST (anon) type_id=28
135s [30] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=4
135s [31] STRUCT _IO_FILE size=216
135s 	_flags type_id=16 bits_offset=0
135s 	_IO_read_ptr type_id=26 bits_offset=64
135s 	_IO_read_end type_id=26 bits_offset=128
135s 	_IO_read_base type_id=26 bits_offset=192
135s 	_IO_write_base type_id=26 bits_offset=256
135s 	_IO_write_ptr type_id=26 bits_offset=320
135s 	_IO_write_end type_id=26 bits_offset=384
135s 	_IO_buf_base type_id=26 bits_offset=448
135s 	_IO_buf_end type_id=26 bits_offset=512
135s 	_IO_save_base type_id=26 bits_offset=576
135s 	_IO_backup_base type_id=26 bits_offset=640
135s 	_IO_save_end type_id=26 bits_offset=704
135s 	_markers type_id=35 bits_offset=768
135s 	_chain type_id=36 bits_offset=832
135s 	_fileno type_id=16 bits_offset=896
135s 	_flags2 type_id=16 bits_offset=928
135s 	_old_offset type_id=22 bits_offset=960
135s 	_cur_column type_id=7 bits_offset=1024
135s 	_vtable_offset type_id=11 bits_offset=1040
135s 	_shortbuf type_id=37 bits_offset=1048
135s 	_lock type_id=38 bits_offset=1088
135s 	_offset type_id=23 bits_offset=1152
135s 	_codecvt type_id=40 bits_offset=1216
135s 	_wide_data type_id=42 bits_offset=1280
135s 	_freeres_list type_id=36 bits_offset=1344
135s 	_freeres_buf type_id=24 bits_offset=1408
135s 	__pad5 type_id=1 bits_offset=1472
135s 	_mode type_id=16 bits_offset=1536
135s 	_unused2 type_id=43 bits_offset=1568
135s [32] TYPEDEF FILE type_id=31
135s [33] TYPEDEF _IO_lock_t type_id=0
135s [34] FWD _IO_marker struct
135s [35] PTR (anon) type_id=34
135s [36] PTR (anon) type_id=31
135s [37] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=1
135s [38] PTR (anon) type_id=33
135s [39] FWD _IO_codecvt struct
135s [40] PTR (anon) type_id=39
135s [41] FWD _IO_wide_data struct
135s [42] PTR (anon) type_id=41
135s [43] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=20
135s [44] PTR (anon) type_id=29
135s [45] RESTRICT (anon) type_id=44
135s [46] TYPEDEF va_list type_id=4
135s [47] TYPEDEF off_t type_id=22
135s [48] PTR (anon) type_id=32
135s [49] RESTRICT (anon) type_id=48
135s [50] ENUM (anon) size=4
135s 	_ISupper val=256
135s 	_ISlower val=512
135s 	_ISalpha val=1024
135s 	_ISdigit val=2048
135s 	_ISxdigit val=4096
135s 	_ISspace val=8192
135s 	_ISprint val=16384
135s 	_ISgraph val=32768
135s 	_ISblank val=1
135s 	_IScntrl val=2
135s 	_ISpunct val=4
135s 	_ISalnum val=8
135s [51] PTR (anon) type_id=8
135s [52] PTR (anon) type_id=16
135s [53] RESTRICT (anon) type_id=52
135s [54] TYPEDEF error_t type_id=16
135s [55] STRUCT argp_option size=48
135s 	name type_id=44 bits_offset=0
135s 	key type_id=16 bits_offset=64
135s 	arg type_id=44 bits_offset=128
135s 	flags type_id=16 bits_offset=192
135s 	doc type_id=44 bits_offset=256
135s 	group type_id=16 bits_offset=320
135s [56] CONST (anon) type_id=55
135s [57] TYPEDEF argp_parser_t type_id=58
135s [58] PTR (anon) type_id=59
135s [59] FUNC_PROTO (anon) return=54 args=(16 (null), 26 (null), 60 (null))
135s [60] PTR (anon) type_id=62
135s [61] RESTRICT (anon) type_id=60
135s [62] STRUCT argp_state size=96
135s 	root_argp type_id=71 bits_offset=0
135s 	argc type_id=16 bits_offset=64
135s 	argv type_id=73 bits_offset=128
135s 	next type_id=16 bits_offset=192
135s 	flags type_id=9 bits_offset=224
135s 	arg_num type_id=9 bits_offset=256
135s 	quoted type_id=16 bits_offset=288
135s 	input type_id=24 bits_offset=320
135s 	child_inputs type_id=75 bits_offset=384
135s 	hook type_id=24 bits_offset=448
135s 	name type_id=26 bits_offset=512
135s 	err_stream type_id=48 bits_offset=576
135s 	out_stream type_id=48 bits_offset=640
135s 	pstate type_id=24 bits_offset=704
135s [63] STRUCT argp size=56
135s 	options type_id=65 bits_offset=0
135s 	parser type_id=57 bits_offset=64
135s 	args_doc type_id=44 bits_offset=128
135s 	doc type_id=44 bits_offset=192
135s 	children type_id=68 bits_offset=256
135s 	help_filter type_id=70 bits_offset=320
135s 	argp_domain type_id=44 bits_offset=384
135s [64] CONST (anon) type_id=63
135s [65] PTR (anon) type_id=56
135s [66] STRUCT argp_child size=32
135s 	argp type_id=71 bits_offset=0
135s 	flags type_id=16 bits_offset=64
135s 	header type_id=44 bits_offset=128
135s 	group type_id=16 bits_offset=192
135s [67] CONST (anon) type_id=66
135s [68] PTR (anon) type_id=67
135s [69] FUNC_PROTO (anon) return=26 args=(16 (null), 44 (null), 24 (null))
135s [70] PTR (anon) type_id=69
135s [71] PTR (anon) type_id=64
135s [72] RESTRICT (anon) type_id=71
135s [73] PTR (anon) type_id=26
135s [74] RESTRICT (anon) type_id=73
135s [75] PTR (anon) type_id=24
135s [76] ENUM (anon) size=4
135s 	DW_TAG_array_type val=1
135s 	DW_TAG_class_type val=2
135s 	DW_TAG_entry_point val=3
135s 	DW_TAG_enumeration_type val=4
135s 	DW_TAG_formal_parameter val=5
135s 	DW_TAG_imported_declaration val=8
135s 	DW_TAG_label val=10
135s 	DW_TAG_lexical_block val=11
135s 	DW_TAG_member val=13
135s 	DW_TAG_pointer_type val=15
135s 	DW_TAG_reference_type val=16
135s 	DW_TAG_compile_unit val=17
135s 	DW_TAG_string_type val=18
135s 	DW_TAG_structure_type val=19
135s 	DW_TAG_subroutine_type val=21
135s 	DW_TAG_typedef val=22
135s 	DW_TAG_union_type val=23
135s 	DW_TAG_unspecified_parameters val=24
135s 	DW_TAG_variant val=25
135s 	DW_TAG_common_block val=26
135s 	DW_TAG_common_inclusion val=27
135s 	DW_TAG_inheritance val=28
135s 	DW_TAG_inlined_subroutine val=29
135s 	DW_TAG_module val=30
135s 	DW_TAG_ptr_to_member_type val=31
135s 	DW_TAG_set_type val=32
135s 	DW_TAG_subrange_type val=33
135s 	DW_TAG_with_stmt val=34
135s 	DW_TAG_access_declaration val=35
135s 	DW_TAG_base_type val=36
135s 	DW_TAG_catch_block val=37
135s 	DW_TAG_const_type val=38
135s 	DW_TAG_constant val=39
135s 	DW_TAG_enumerator val=40
135s 	DW_TAG_file_type val=41
135s 	DW_TAG_friend val=42
135s 	DW_TAG_namelist val=43
135s 	DW_TAG_namelist_item val=44
135s 	DW_TAG_packed_type val=45
135s 	DW_TAG_subprogram val=46
135s 	DW_TAG_template_type_parameter val=47
135s 	DW_TAG_template_value_parameter val=48
135s 	DW_TAG_thrown_type val=49
135s 	DW_TAG_try_block val=50
135s 	DW_TAG_variant_part val=51
135s 	DW_TAG_variable val=52
135s 	DW_TAG_volatile_type val=53
135s 	DW_TAG_dwarf_procedure val=54
135s 	DW_TAG_restrict_type val=55
135s 	DW_TAG_interface_type val=56
135s 	DW_TAG_namespace val=57
135s 	DW_TAG_imported_module val=58
135s 	DW_TAG_unspecified_type val=59
135s 	DW_TAG_partial_unit val=60
135s 	DW_TAG_imported_unit val=61
135s 	DW_TAG_condition val=63
135s 	DW_TAG_shared_type val=64
135s 	DW_TAG_type_unit val=65
135s 	DW_TAG_rvalue_reference_type val=66
135s 	DW_TAG_template_alias val=67
135s 	DW_TAG_coarray_type val=68
135s 	DW_TAG_generic_subrange val=69
135s 	DW_TAG_dynamic_type val=70
135s 	DW_TAG_atomic_type val=71
135s 	DW_TAG_call_site val=72
135s 	DW_TAG_call_site_parameter val=73
135s 	DW_TAG_skeleton_unit val=74
135s 	DW_TAG_immutable_type val=75
135s 	DW_TAG_lo_user val=16512
135s 	DW_TAG_MIPS_loop val=16513
135s 	DW_TAG_format_label val=16641
135s 	DW_TAG_function_template val=16642
135s 	DW_TAG_class_template val=16643
135s 	DW_TAG_GNU_BINCL val=16644
135s 	DW_TAG_GNU_EINCL val=16645
135s 	DW_TAG_GNU_template_template_param val=16646
135s 	DW_TAG_GNU_template_parameter_pack val=16647
135s 	DW_TAG_GNU_formal_parameter_pack val=16648
135s 	DW_TAG_GNU_call_site val=16649
135s 	DW_TAG_GNU_call_site_parameter val=16650
135s 	DW_TAG_hi_user val=65535
135s [77] TYPEDEF int8_t type_id=10
135s [78] TYPEDEF int32_t type_id=15
135s [79] TYPEDEF int64_t type_id=19
135s [80] TYPEDEF uint8_t type_id=12
135s [81] CONST (anon) type_id=80
135s [82] TYPEDEF uint16_t type_id=14
135s [83] CONST (anon) type_id=82
135s [84] TYPEDEF uint32_t type_id=18
135s [85] CONST (anon) type_id=84
135s [86] TYPEDEF uint64_t type_id=21
135s [87] INT long long unsigned int size=8 nr_bits=64 encoding=(none)
135s [88] STRUCT __pthread_internal_list size=16
135s 	__prev type_id=89 bits_offset=0
135s 	__next type_id=89 bits_offset=64
135s [89] PTR (anon) type_id=88
135s [90] TYPEDEF __pthread_list_t type_id=88
135s [91] STRUCT __pthread_mutex_s size=40
135s 	__lock type_id=16 bits_offset=0
135s 	__count type_id=9 bits_offset=32
135s 	__owner type_id=16 bits_offset=64
135s 	__nusers type_id=9 bits_offset=96
135s 	__kind type_id=16 bits_offset=128
135s 	__spins type_id=16 bits_offset=160
135s 	__list type_id=90 bits_offset=192
135s [92] UNION (anon) size=40
135s 	__data type_id=91 bits_offset=0
135s 	__size type_id=93 bits_offset=0
135s 	__align type_id=20 bits_offset=0
135s [93] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=40
135s [94] TYPEDEF pthread_mutex_t type_id=92
135s [95] INT long long int size=8 nr_bits=64 encoding=SIGNED
135s [96] INT double size=8 nr_bits=64 encoding=(none)
135s [97] ENUM (anon) size=4
135s 	PTHREAD_MUTEX_TIMED_NP val=0
135s 	PTHREAD_MUTEX_RECURSIVE_NP val=1
135s 	PTHREAD_MUTEX_ERRORCHECK_NP val=2
135s 	PTHREAD_MUTEX_ADAPTIVE_NP val=3
135s 	PTHREAD_MUTEX_NORMAL val=0
135s 	PTHREAD_MUTEX_RECURSIVE val=1
135s 	PTHREAD_MUTEX_ERRORCHECK val=2
135s 	PTHREAD_MUTEX_DEFAULT val=0
135s [98] TYPEDEF __compar_fn_t type_id=99
135s [99] PTR (anon) type_id=100
135s [100] FUNC_PROTO (anon) return=16 args=(101 (null), 101 (null))
135s [101] PTR (anon) type_id=102
135s [102] CONST (anon) type_id=0
135s [103] ENUM (anon) size=4
135s 	_SC_ARG_MAX val=0
135s 	_SC_CHILD_MAX val=1
135s 	_SC_CLK_TCK val=2
135s 	_SC_NGROUPS_MAX val=3
135s 	_SC_OPEN_MAX val=4
135s 	_SC_STREAM_MAX val=5
135s 	_SC_TZNAME_MAX val=6
135s 	_SC_JOB_CONTROL val=7
135s 	_SC_SAVED_IDS val=8
135s 	_SC_REALTIME_SIGNALS val=9
135s 	_SC_PRIORITY_SCHEDULING val=10
135s 	_SC_TIMERS val=11
135s 	_SC_ASYNCHRONOUS_IO val=12
135s 	_SC_PRIORITIZED_IO val=13
135s 	_SC_SYNCHRONIZED_IO val=14
135s 	_SC_FSYNC val=15
135s 	_SC_MAPPED_FILES val=16
135s 	_SC_MEMLOCK val=17
135s 	_SC_MEMLOCK_RANGE val=18
135s 	_SC_MEMORY_PROTECTION val=19
135s 	_SC_MESSAGE_PASSING val=20
135s 	_SC_SEMAPHORES val=21
135s 	_SC_SHARED_MEMORY_OBJECTS val=22
135s 	_SC_AIO_LISTIO_MAX val=23
135s 	_SC_AIO_MAX val=24
135s 	_SC_AIO_PRIO_DELTA_MAX val=25
135s 	_SC_DELAYTIMER_MAX val=26
135s 	_SC_MQ_OPEN_MAX val=27
135s 	_SC_MQ_PRIO_MAX val=28
135s 	_SC_VERSION val=29
135s 	_SC_PAGESIZE val=30
135s 	_SC_RTSIG_MAX val=31
135s 	_SC_SEM_NSEMS_MAX val=32
135s 	_SC_SEM_VALUE_MAX val=33
135s 	_SC_SIGQUEUE_MAX val=34
135s 	_SC_TIMER_MAX val=35
135s 	_SC_BC_BASE_MAX val=36
135s 	_SC_BC_DIM_MAX val=37
135s 	_SC_BC_SCALE_MAX val=38
135s 	_SC_BC_STRING_MAX val=39
135s 	_SC_COLL_WEIGHTS_MAX val=40
135s 	_SC_EQUIV_CLASS_MAX val=41
135s 	_SC_EXPR_NEST_MAX val=42
135s 	_SC_LINE_MAX val=43
135s 	_SC_RE_DUP_MAX val=44
135s 	_SC_CHARCLASS_NAME_MAX val=45
135s 	_SC_2_VERSION val=46
135s 	_SC_2_C_BIND val=47
135s 	_SC_2_C_DEV val=48
135s 	_SC_2_FORT_DEV val=49
135s 	_SC_2_FORT_RUN val=50
135s 	_SC_2_SW_DEV val=51
135s 	_SC_2_LOCALEDEF val=52
135s 	_SC_PII val=53
135s 	_SC_PII_XTI val=54
135s 	_SC_PII_SOCKET val=55
135s 	_SC_PII_INTERNET val=56
135s 	_SC_PII_OSI val=57
135s 	_SC_POLL val=58
135s 	_SC_SELECT val=59
135s 	_SC_UIO_MAXIOV val=60
135s 	_SC_IOV_MAX val=60
135s 	_SC_PII_INTERNET_STREAM val=61
135s 	_SC_PII_INTERNET_DGRAM val=62
135s 	_SC_PII_OSI_COTS val=63
135s 	_SC_PII_OSI_CLTS val=64
135s 	_SC_PII_OSI_M val=65
135s 	_SC_T_IOV_MAX val=66
135s 	_SC_THREADS val=67
135s 	_SC_THREAD_SAFE_FUNCTIONS val=68
135s 	_SC_GETGR_R_SIZE_MAX val=69
135s 	_SC_GETPW_R_SIZE_MAX val=70
135s 	_SC_LOGIN_NAME_MAX val=71
135s 	_SC_TTY_NAME_MAX val=72
135s 	_SC_THREAD_DESTRUCTOR_ITERATIONS val=73
135s 	_SC_THREAD_KEYS_MAX val=74
135s 	_SC_THREAD_STACK_MIN val=75
135s 	_SC_THREAD_THREADS_MAX val=76
135s 	_SC_THREAD_ATTR_STACKADDR val=77
135s 	_SC_THREAD_ATTR_STACKSIZE val=78
135s 	_SC_THREAD_PRIORITY_SCHEDULING val=79
135s 	_SC_THREAD_PRIO_INHERIT val=80
135s 	_SC_THREAD_PRIO_PROTECT val=81
135s 	_SC_THREAD_PROCESS_SHARED val=82
135s 	_SC_NPROCESSORS_CONF val=83
135s 	_SC_NPROCESSORS_ONLN val=84
135s 	_SC_PHYS_PAGES val=85
135s 	_SC_AVPHYS_PAGES val=86
135s 	_SC_ATEXIT_MAX val=87
135s 	_SC_PASS_MAX val=88
135s 	_SC_XOPEN_VERSION val=89
135s 	_SC_XOPEN_XCU_VERSION val=90
135s 	_SC_XOPEN_UNIX val=91
135s 	_SC_XOPEN_CRYPT val=92
135s 	_SC_XOPEN_ENH_I18N val=93
135s 	_SC_XOPEN_SHM val=94
135s 	_SC_2_CHAR_TERM val=95
135s 	_SC_2_C_VERSION val=96
135s 	_SC_2_UPE val=97
135s 	_SC_XOPEN_XPG2 val=98
135s 	_SC_XOPEN_XPG3 val=99
135s 	_SC_XOPEN_XPG4 val=100
135s 	_SC_CHAR_BIT val=101
135s 	_SC_CHAR_MAX val=102
135s 	_SC_CHAR_MIN val=103
135s 	_SC_INT_MAX val=104
135s 	_SC_INT_MIN val=105
135s 	_SC_LONG_BIT val=106
135s 	_SC_WORD_BIT val=107
135s 	_SC_MB_LEN_MAX val=108
135s 	_SC_NZERO val=109
135s 	_SC_SSIZE_MAX val=110
135s 	_SC_SCHAR_MAX val=111
135s 	_SC_SCHAR_MIN val=112
135s 	_SC_SHRT_MAX val=113
135s 	_SC_SHRT_MIN val=114
135s 	_SC_UCHAR_MAX val=115
135s 	_SC_UINT_MAX val=116
135s 	_SC_ULONG_MAX val=117
135s 	_SC_USHRT_MAX val=118
135s 	_SC_NL_ARGMAX val=119
135s 	_SC_NL_LANGMAX val=120
135s 	_SC_NL_MSGMAX val=121
135s 	_SC_NL_NMAX val=122
135s 	_SC_NL_SETMAX val=123
135s 	_SC_NL_TEXTMAX val=124
135s 	_SC_XBS5_ILP32_OFF32 val=125
135s 	_SC_XBS5_ILP32_OFFBIG val=126
135s 	_SC_XBS5_LP64_OFF64 val=127
135s 	_SC_XBS5_LPBIG_OFFBIG val=128
135s 	_SC_XOPEN_LEGACY val=129
135s 	_SC_XOPEN_REALTIME val=130
135s 	_SC_XOPEN_REALTIME_THREADS val=131
135s 	_SC_ADVISORY_INFO val=132
135s 	_SC_BARRIERS val=133
135s 	_SC_BASE val=134
135s 	_SC_C_LANG_SUPPORT val=135
135s 	_SC_C_LANG_SUPPORT_R val=136
135s 	_SC_CLOCK_SELECTION val=137
135s 	_SC_CPUTIME val=138
135s 	_SC_THREAD_CPUTIME val=139
135s 	_SC_DEVICE_IO val=140
135s 	_SC_DEVICE_SPECIFIC val=141
135s 	_SC_DEVICE_SPECIFIC_R val=142
135s 	_SC_FD_MGMT val=143
135s 	_SC_FIFO val=144
135s 	_SC_PIPE val=145
135s 	_SC_FILE_ATTRIBUTES val=146
135s 	_SC_FILE_LOCKING val=147
135s 	_SC_FILE_SYSTEM val=148
135s 	_SC_MONOTONIC_CLOCK val=149
135s 	_SC_MULTI_PROCESS val=150
135s 	_SC_SINGLE_PROCESS val=151
135s 	_SC_NETWORKING val=152
135s 	_SC_READER_WRITER_LOCKS val=153
135s 	_SC_SPIN_LOCKS val=154
135s 	_SC_REGEXP val=155
135s 	_SC_REGEX_VERSION val=156
135s 	_SC_SHELL val=157
135s 	_SC_SIGNALS val=158
135s 	_SC_SPAWN val=159
135s 	_SC_SPORADIC_SERVER val=160
135s 	_SC_THREAD_SPORADIC_SERVER val=161
135s 	_SC_SYSTEM_DATABASE val=162
135s 	_SC_SYSTEM_DATABASE_R val=163
135s 	_SC_TIMEOUTS val=164
135s 	_SC_TYPED_MEMORY_OBJECTS val=165
135s 	_SC_USER_GROUPS val=166
135s 	_SC_USER_GROUPS_R val=167
135s 	_SC_2_PBS val=168
135s 	_SC_2_PBS_ACCOUNTING val=169
135s 	_SC_2_PBS_LOCATE val=170
135s 	_SC_2_PBS_MESSAGE val=171
135s 	_SC_2_PBS_TRACK val=172
135s 	_SC_SYMLOOP_MAX val=173
135s 	_SC_STREAMS val=174
135s 	_SC_2_PBS_CHECKPOINT val=175
135s 	_SC_V6_ILP32_OFF32 val=176
135s 	_SC_V6_ILP32_OFFBIG val=177
135s 	_SC_V6_LP64_OFF64 val=178
135s 	_SC_V6_LPBIG_OFFBIG val=179
135s 	_SC_HOST_NAME_MAX val=180
135s 	_SC_TRACE val=181
135s 	_SC_TRACE_EVENT_FILTER val=182
135s 	_SC_TRACE_INHERIT val=183
135s 	_SC_TRACE_LOG val=184
135s 	_SC_LEVEL1_ICACHE_SIZE val=185
135s 	_SC_LEVEL1_ICACHE_ASSOC val=186
135s 	_SC_LEVEL1_ICACHE_LINESIZE val=187
135s 	_SC_LEVEL1_DCACHE_SIZE val=188
135s 	_SC_LEVEL1_DCACHE_ASSOC val=189
135s 	_SC_LEVEL1_DCACHE_LINESIZE val=190
135s 	_SC_LEVEL2_CACHE_SIZE val=191
135s 	_SC_LEVEL2_CACHE_ASSOC val=192
135s 	_SC_LEVEL2_CACHE_LINESIZE val=193
135s 	_SC_LEVEL3_CACHE_SIZE val=194
135s 	_SC_LEVEL3_CACHE_ASSOC val=195
135s 	_SC_LEVEL3_CACHE_LINESIZE val=196
135s 	_SC_LEVEL4_CACHE_SIZE val=197
135s 	_SC_LEVEL4_CACHE_ASSOC val=198
135s 	_SC_LEVEL4_CACHE_LINESIZE val=199
135s 	_SC_IPV6 val=235
135s 	_SC_RAW_SOCKETS val=236
135s 	_SC_V7_ILP32_OFF32 val=237
135s 	_SC_V7_ILP32_OFFBIG val=238
135s 	_SC_V7_LP64_OFF64 val=239
135s 	_SC_V7_LPBIG_OFFBIG val=240
135s 	_SC_SS_REPL_MAX val=241
135s 	_SC_TRACE_EVENT_NAME_MAX val=242
135s 	_SC_TRACE_NAME_MAX val=243
135s 	_SC_TRACE_SYS_MAX val=244
135s 	_SC_TRACE_USER_EVENT_MAX val=245
135s 	_SC_XOPEN_STREAMS val=246
135s 	_SC_THREAD_ROBUST_PRIO_INHERIT val=247
135s 	_SC_THREAD_ROBUST_PRIO_PROTECT val=248
135s 	_SC_MINSIGSTKSZ val=249
135s 	_SC_SIGSTKSZ val=250
135s [104] FWD btf_ext struct
135s [105] PTR (anon) type_id=104
135s [106] INT _Bool size=1 nr_bits=8 encoding=BOOL
135s [107] INT long double size=16 nr_bits=128 encoding=(none)
135s [108] ENUM libbpf_print_level size=4
135s 	LIBBPF_WARN val=0
135s 	LIBBPF_INFO val=1
135s 	LIBBPF_DEBUG val=2
135s [109] TYPEDEF libbpf_print_fn_t type_id=110
135s [110] PTR (anon) type_id=111
135s [111] FUNC_PROTO (anon) return=16 args=(108 (null), 44 (null), 46 (null))
135s [112] STRUCT _obstack_chunk size=24
135s 	limit type_id=26 bits_offset=0
135s 	prev type_id=113 bits_offset=64
135s 	contents type_id=30 bits_offset=128
135s [113] PTR (anon) type_id=112
135s [114] UNION (anon) size=8
135s 	tempint type_id=20 bits_offset=0
135s 	tempptr type_id=24 bits_offset=0
135s [115] STRUCT obstack size=88
135s 	chunk_size type_id=20 bits_offset=0
135s 	chunk type_id=113 bits_offset=64
135s 	object_base type_id=26 bits_offset=128
135s 	next_free type_id=26 bits_offset=192
135s 	chunk_limit type_id=26 bits_offset=256
135s 	temp type_id=114 bits_offset=320
135s 	alignment_mask type_id=16 bits_offset=384
135s 	chunkfun type_id=117 bits_offset=448
135s 	freefun type_id=119 bits_offset=512
135s 	extra_arg type_id=24 bits_offset=576
135s 	use_extra_arg type_id=9 bitfield_size=1 bits_offset=640
135s 	maybe_empty_object type_id=9 bitfield_size=1 bits_offset=641
135s 	alloc_failed type_id=9 bitfield_size=1 bits_offset=642
135s [116] FUNC_PROTO (anon) return=113 args=(24 (null), 20 (null))
135s [117] PTR (anon) type_id=116
135s [118] FUNC_PROTO (anon) return=0 args=(24 (null), 113 (null))
135s [119] PTR (anon) type_id=118
135s [120] FUNC_PROTO (anon) return=0 args=(void)
135s [121] PTR (anon) type_id=120
135s [122] TYPEDEF Elf type_id=123
135s [123] FWD Elf struct
135s [124] TYPEDEF Dwfl_Module type_id=125
135s [125] FWD Dwfl_Module struct
135s [126] PTR (anon) type_id=124
135s [127] PTR (anon) type_id=122
135s [128] STRUCT rb_node size=24
135s 	rb_parent_color type_id=3 bits_offset=0
135s 	rb_right type_id=130 bits_offset=64
135s 	rb_left type_id=130 bits_offset=128
135s [129] CONST (anon) type_id=128
135s [130] PTR (anon) type_id=128
135s [131] STRUCT rb_root size=8
135s 	rb_node type_id=130 bits_offset=0
135s [132] CONST (anon) type_id=131
135s [133] STRUCT list_head size=16
135s 	next type_id=135 bits_offset=0
135s 	prev type_id=135 bits_offset=64
135s [134] CONST (anon) type_id=133
135s [135] PTR (anon) type_id=133
135s [136] STRUCT hlist_node size=16
135s 	next type_id=137 bits_offset=0
135s 	pprev type_id=138 bits_offset=64
135s [137] PTR (anon) type_id=136
135s [138] PTR (anon) type_id=137
135s [139] ENUM load_steal_kind size=4
135s 	LSK__KEEPIT val=0
135s 	LSK__DELETE val=1
135s 	LSK__STOP_LOADING val=2
135s [140] TYPEDEF type_id_t type_id=84
135s [141] CONST (anon) type_id=140
135s [142] STRUCT conf_load size=96
135s 	steal type_id=149 bits_offset=0
135s 	thread_exit type_id=151 bits_offset=64
135s 	cookie type_id=24 bits_offset=128
135s 	format_path type_id=26 bits_offset=192
135s 	nr_jobs type_id=16 bits_offset=256
135s 	extra_dbg_info type_id=106 bits_offset=288
135s 	use_obstack type_id=106 bits_offset=296
135s 	fixup_silly_bitfields type_id=106 bits_offset=304
135s 	get_addr_info type_id=106 bits_offset=312
135s 	ignore_alignment_attr type_id=106 bits_offset=320
135s 	ignore_inline_expansions type_id=106 bits_offset=328
135s 	ignore_labels type_id=106 bits_offset=336
135s 	ptr_table_stats type_id=106 bits_offset=344
135s 	skip_encoding_btf_decl_tag type_id=106 bits_offset=352
135s 	skip_missing type_id=106 bits_offset=360
135s 	skip_encoding_btf_type_tag type_id=106 bits_offset=368
135s 	skip_encoding_btf_enum64 type_id=106 bits_offset=376
135s 	btf_gen_optimized type_id=106 bits_offset=384
135s 	skip_encoding_btf_inconsistent_proto type_id=106 bits_offset=392
135s 	hashtable_bits type_id=80 bits_offset=400
135s 	max_hashtable_bits type_id=80 bits_offset=408
135s 	kabi_prefix_len type_id=82 bits_offset=416
135s 	kabi_prefix type_id=44 bits_offset=448
135s 	base_btf type_id=153 bits_offset=512
135s 	conf_fprintf type_id=156 bits_offset=576
135s 	threads_prepare type_id=158 bits_offset=640
135s 	threads_collect type_id=160 bits_offset=704
135s [143] CONST (anon) type_id=142
135s [144] FUNC_PROTO (anon) return=139 args=(145 (null), 148 (null), 24 (null))
135s [145] PTR (anon) type_id=146
135s [146] STRUCT cu size=344
135s 	node type_id=133 bits_offset=0
135s 	tags type_id=133 bits_offset=128
135s 	tool_list type_id=133 bits_offset=256
135s 	types_table type_id=162 bits_offset=384
135s 	functions_table type_id=162 bits_offset=512
135s 	tags_table type_id=162 bits_offset=640
135s 	functions type_id=131 bits_offset=768
135s 	name type_id=26 bits_offset=832
135s 	filename type_id=26 bits_offset=896
135s 	priv type_id=24 bits_offset=960
135s 	dfops type_id=182 bits_offset=1024
135s 	elf type_id=127 bits_offset=1088
135s 	dwfl type_id=126 bits_offset=1152
135s 	obstack type_id=115 bits_offset=1216
135s 	cached_symtab_nr_entries type_id=84 bits_offset=1920
135s 	use_obstack type_id=106 bits_offset=1952
135s 	addr_size type_id=80 bits_offset=1960
135s 	extra_dbg_info type_id=80 bitfield_size=1 bits_offset=1968
135s 	has_addr_info type_id=80 bitfield_size=1 bits_offset=1969
135s 	uses_global_strings type_id=80 bitfield_size=1 bits_offset=1970
135s 	little_endian type_id=80 bitfield_size=1 bits_offset=1971
135s 	nr_register_params type_id=80 bitfield_size=0 bits_offset=1976
135s 	register_params type_id=183 bitfield_size=0 bits_offset=1984
135s 	language type_id=82 bitfield_size=0 bits_offset=2240
135s 	nr_inline_expansions type_id=3 bitfield_size=0 bits_offset=2304
135s 	size_inline_expansions type_id=1 bitfield_size=0 bits_offset=2368
135s 	nr_functions_changed type_id=84 bitfield_size=0 bits_offset=2432
135s 	nr_structures_changed type_id=84 bitfield_size=0 bits_offset=2464
135s 	max_len_changed_item type_id=1 bitfield_size=0 bits_offset=2496
135s 	function_bytes_added type_id=1 bitfield_size=0 bits_offset=2560
135s 	function_bytes_removed type_id=1 bitfield_size=0 bits_offset=2624
135s 	build_id_len type_id=16 bitfield_size=0 bits_offset=2688
135s 	build_id type_id=184 bitfield_size=0 bits_offset=2720
135s [147] CONST (anon) type_id=146
135s [148] PTR (anon) type_id=142
135s [149] PTR (anon) type_id=144
135s [150] FUNC_PROTO (anon) return=16 args=(148 (null), 24 (null))
135s [151] PTR (anon) type_id=150
135s [152] FWD btf struct
135s [153] PTR (anon) type_id=152
135s [154] STRUCT conf_fprintf size=88
135s 	prefix type_id=44 bits_offset=0
135s 	suffix type_id=44 bits_offset=64
135s 	type_spacing type_id=78 bits_offset=128
135s 	name_spacing type_id=78 bits_offset=160
135s 	base_offset type_id=84 bits_offset=192
135s 	count type_id=84 bits_offset=224
135s 	cachelinep type_id=161 bits_offset=256
135s 	seek_bytes type_id=44 bits_offset=320
135s 	size_bytes type_id=44 bits_offset=384
135s 	header_type type_id=44 bits_offset=448
135s 	range type_id=44 bits_offset=512
135s 	skip type_id=84 bits_offset=576
135s 	cacheline_size type_id=82 bits_offset=608
135s 	indent type_id=80 bits_offset=624
135s 	expand_types type_id=80 bitfield_size=1 bits_offset=632
135s 	expand_pointers type_id=80 bitfield_size=1 bits_offset=633
135s 	rel_offset type_id=80 bitfield_size=1 bits_offset=634
135s 	emit_stats type_id=80 bitfield_size=1 bits_offset=635
135s 	suppress_comments type_id=80 bitfield_size=1 bits_offset=636
135s 	has_alignment_info type_id=80 bitfield_size=1 bits_offset=637
135s 	suppress_aligned_attribute type_id=80 bitfield_size=1 bits_offset=638
135s 	suppress_offset_comment type_id=80 bitfield_size=1 bits_offset=639
135s 	suppress_force_paddings type_id=80 bitfield_size=1 bits_offset=640
135s 	suppress_packed type_id=80 bitfield_size=1 bits_offset=641
135s 	show_decl_info type_id=80 bitfield_size=1 bits_offset=642
135s 	show_only_data_members type_id=80 bitfield_size=1 bits_offset=643
135s 	no_semicolon type_id=80 bitfield_size=1 bits_offset=644
135s 	show_first_biggest_size_base_type_member type_id=80 bitfield_size=1 bits_offset=645
135s 	flat_arrays type_id=80 bitfield_size=1 bits_offset=646
135s 	first_member type_id=80 bitfield_size=1 bits_offset=647
135s 	last_member type_id=80 bitfield_size=1 bits_offset=648
135s 	union_member type_id=80 bitfield_size=1 bits_offset=649
135s 	no_parm_names type_id=80 bitfield_size=1 bits_offset=650
135s 	classes_as_structs type_id=80 bitfield_size=1 bits_offset=651
135s 	hex_fmt type_id=80 bitfield_size=1 bits_offset=652
135s 	strip_inline type_id=80 bitfield_size=1 bits_offset=653
135s 	skip_emitting_atomic_typedefs type_id=80 bitfield_size=1 bits_offset=654
135s 	skip_emitting_errors type_id=80 bitfield_size=1 bits_offset=655
135s 	skip_emitting_modifier type_id=80 bitfield_size=1 bits_offset=656
135s [155] CONST (anon) type_id=154
135s [156] PTR (anon) type_id=154
135s [157] FUNC_PROTO (anon) return=16 args=(148 (null), 16 (null), 75 (null))
135s [158] PTR (anon) type_id=157
135s [159] FUNC_PROTO (anon) return=16 args=(148 (null), 16 (null), 75 (null), 16 (null))
135s [160] PTR (anon) type_id=159
135s [161] PTR (anon) type_id=84
135s [162] STRUCT ptr_table size=16
135s 	entries type_id=75 bits_offset=0
135s 	nr_entries type_id=84 bits_offset=64
135s 	allocated_entries type_id=84 bits_offset=96
135s [163] STRUCT debug_fmt_ops size=72
135s 	name type_id=44 bits_offset=0
135s 	init type_id=165 bits_offset=64
135s 	exit type_id=121 bits_offset=128
135s 	load_file type_id=169 bits_offset=192
135s 	tag__decl_file type_id=175 bits_offset=256
135s 	tag__decl_line type_id=177 bits_offset=320
135s 	tag__orig_id type_id=179 bits_offset=384
135s 	cu__delete type_id=181 bits_offset=448
135s 	has_alignment_info type_id=106 bits_offset=512
135s [164] FUNC_PROTO (anon) return=16 args=(void)
135s [165] PTR (anon) type_id=164
135s [166] FUNC_PROTO (anon) return=16 args=(167 (null), 148 (null), 44 (null))
135s [167] PTR (anon) type_id=168
135s [168] FWD cus struct
135s [169] PTR (anon) type_id=166
135s [170] FUNC_PROTO (anon) return=44 args=(171 (null), 174 (null))
135s [171] PTR (anon) type_id=173
135s [172] STRUCT tag size=40
135s 	node type_id=133 bits_offset=0
135s 	type type_id=140 bits_offset=128
135s 	tag type_id=82 bits_offset=160
135s 	visited type_id=106 bits_offset=176
135s 	top_level type_id=106 bits_offset=184
135s 	has_btf_type_tag type_id=106 bits_offset=192
135s 	recursivity_level type_id=82 bits_offset=208
135s 	priv type_id=24 bits_offset=256
135s [173] CONST (anon) type_id=172
135s [174] PTR (anon) type_id=147
135s [175] PTR (anon) type_id=170
135s [176] FUNC_PROTO (anon) return=84 args=(171 (null), 174 (null))
135s [177] PTR (anon) type_id=176
135s [178] FUNC_PROTO (anon) return=87 args=(171 (null), 174 (null))
135s [179] PTR (anon) type_id=178
135s [180] FUNC_PROTO (anon) return=0 args=(145 (null))
135s [181] PTR (anon) type_id=180
135s [182] PTR (anon) type_id=163
135s [183] ARRAY (anon) type_id=16 index_type_id=16 nr_elems=8
135s [184] ARRAY (anon) type_id=6 index_type_id=16 nr_elems=0
135s [185] STRUCT tag_cu size=16
135s 	tag type_id=186 bits_offset=0
135s 	cu type_id=145 bits_offset=64
135s [186] PTR (anon) type_id=172
135s [187] STRUCT namespace size=88
135s 	tag type_id=172 bits_offset=0
135s 	name type_id=44 bits_offset=320
135s 	nr_tags type_id=82 bits_offset=384
135s 	shared_tags type_id=80 bits_offset=400
135s 	tags type_id=133 bits_offset=448
135s 	annots type_id=133 bits_offset=576
135s [188] CONST (anon) type_id=187
135s [189] STRUCT ip_tag size=48
135s 	tag type_id=172 bits_offset=0
135s 	addr type_id=86 bits_offset=320
135s [190] STRUCT lexblock size=80
135s 	ip type_id=189 bits_offset=0
135s 	tags type_id=133 bits_offset=384
135s 	size type_id=84 bits_offset=512
135s 	nr_inline_expansions type_id=82 bits_offset=544
135s 	nr_labels type_id=82 bits_offset=560
135s 	nr_variables type_id=82 bits_offset=576
135s 	nr_lexblocks type_id=82 bits_offset=592
135s 	size_inline_expansions type_id=84 bits_offset=608
135s [191] STRUCT ftype size=64
135s 	tag type_id=172 bits_offset=0
135s 	parms type_id=133 bits_offset=320
135s 	nr_parms type_id=82 bits_offset=448
135s 	unspec_parms type_id=80 bitfield_size=1 bits_offset=464
135s 	optimized_parms type_id=80 bitfield_size=1 bits_offset=465
135s 	unexpected_reg type_id=80 bitfield_size=1 bits_offset=466
135s 	processed type_id=80 bitfield_size=1 bits_offset=467
135s 	inconsistent_proto type_id=80 bitfield_size=1 bits_offset=468
135s [192] UNION (anon) size=16
135s 	tool_node type_id=133 bits_offset=0
135s 	tool_hnode type_id=136 bits_offset=0
135s [193] STRUCT function size=264
135s 	proto type_id=191 bits_offset=0
135s 	lexblock type_id=190 bits_offset=512
135s 	rb_node type_id=128 bits_offset=1152
135s 	name type_id=44 bits_offset=1344
135s 	linkage_name type_id=44 bits_offset=1408
135s 	alias type_id=44 bits_offset=1472
135s 	cu_total_size_inline_expansions type_id=84 bits_offset=1536
135s 	cu_total_nr_inline_expansions type_id=82 bits_offset=1568
135s 	inlined type_id=80 bitfield_size=2 bits_offset=1584
135s 	abstract_origin type_id=80 bitfield_size=1 bits_offset=1586
135s 	external type_id=80 bitfield_size=1 bits_offset=1587
135s 	accessibility type_id=80 bitfield_size=2 bits_offset=1588
135s 	virtuality type_id=80 bitfield_size=2 bits_offset=1590
135s 	declaration type_id=80 bitfield_size=1 bits_offset=1592
135s 	btf type_id=80 bitfield_size=1 bits_offset=1593
135s 	vtable_entry type_id=78 bitfield_size=0 bits_offset=1600
135s 	vtable_node type_id=133 bitfield_size=0 bits_offset=1664
135s 	annots type_id=133 bitfield_size=0 bits_offset=1792
135s 	(anon) type_id=192 bitfield_size=0 bits_offset=1920
135s 	priv type_id=24 bitfield_size=0 bits_offset=2048
135s [194] STRUCT class_member size=96
135s 	tag type_id=172 bits_offset=0
135s 	name type_id=44 bits_offset=320
135s 	bit_offset type_id=84 bits_offset=384
135s 	bit_size type_id=84 bits_offset=416
135s 	byte_offset type_id=84 bits_offset=448
135s 	byte_size type_id=1 bits_offset=512
135s 	bitfield_offset type_id=77 bits_offset=576
135s 	bitfield_size type_id=80 bits_offset=584
135s 	bit_hole type_id=80 bits_offset=592
135s 	bitfield_end type_id=80 bitfield_size=1 bits_offset=600
135s 	const_value type_id=86 bitfield_size=0 bits_offset=640
135s 	alignment type_id=84 bitfield_size=0 bits_offset=704
135s 	visited type_id=80 bitfield_size=1 bits_offset=736
135s 	is_static type_id=80 bitfield_size=1 bits_offset=737
135s 	has_bit_offset type_id=80 bitfield_size=1 bits_offset=738
135s 	accessibility type_id=80 bitfield_size=2 bits_offset=739
135s 	virtuality type_id=80 bitfield_size=2 bits_offset=741
135s 	hole type_id=82 bitfield_size=0 bits_offset=752
135s [195] CONST (anon) type_id=194
135s [196] STRUCT tag_cu_node size=32
135s 	node type_id=133 bits_offset=0
135s 	tc type_id=185 bits_offset=128
135s [197] STRUCT type size=176
135s 	namespace type_id=187 bits_offset=0
135s 	node type_id=133 bits_offset=704
135s 	size type_id=84 bits_offset=832
135s 	size_diff type_id=78 bits_offset=864
135s 	nr_static_members type_id=82 bits_offset=896
135s 	nr_members type_id=82 bits_offset=912
135s 	alignment type_id=84 bits_offset=928
135s 	sizeof_member type_id=199 bits_offset=960
135s 	type_member type_id=199 bits_offset=1024
135s 	filter type_id=201 bits_offset=1088
135s 	type_enum type_id=133 bits_offset=1152
135s 	member_prefix type_id=26 bits_offset=1280
135s 	member_prefix_len type_id=82 bits_offset=1344
135s 	max_tag_name_len type_id=82 bits_offset=1360
135s 	natural_alignment type_id=82 bits_offset=1376
135s 	suffix_disambiguation type_id=80 bits_offset=1392
135s 	packed_attributes_inferred type_id=80 bitfield_size=1 bits_offset=1400
135s 	declaration type_id=80 bitfield_size=1 bits_offset=1401
135s 	definition_emitted type_id=80 bitfield_size=1 bits_offset=1402
135s 	fwd_decl_emitted type_id=80 bitfield_size=1 bits_offset=1403
135s 	resized type_id=80 bitfield_size=1 bits_offset=1404
135s 	is_signed_enum type_id=80 bitfield_size=1 bits_offset=1405
135s [198] CONST (anon) type_id=197
135s [199] PTR (anon) type_id=194
135s [200] STRUCT class_member_filter size=16
135s 	left type_id=199 bits_offset=0
135s 	right type_id=86 bits_offset=64
135s [201] PTR (anon) type_id=200
135s [202] STRUCT class size=216
135s 	type type_id=197 bits_offset=0
135s 	vtable type_id=133 bits_offset=1408
135s 	nr_vtable_entries type_id=82 bits_offset=1536
135s 	nr_holes type_id=80 bits_offset=1552
135s 	nr_bit_holes type_id=80 bits_offset=1560
135s 	pre_hole type_id=82 bits_offset=1568
135s 	padding type_id=82 bits_offset=1584
135s 	pre_bit_hole type_id=80 bits_offset=1600
135s 	bit_padding type_id=80 bits_offset=1608
135s 	holes_searched type_id=106 bits_offset=1616
135s 	is_packed type_id=106 bits_offset=1624
135s 	priv type_id=24 bits_offset=1664
135s [203] CONST (anon) type_id=202
135s [204] STRUCT base_type size=72
135s 	tag type_id=172 bits_offset=0
135s 	name type_id=44 bits_offset=320
135s 	node type_id=133 bits_offset=384
135s 	bit_size type_id=82 bits_offset=512
135s 	name_has_encoding type_id=80 bitfield_size=1 bits_offset=528
135s 	is_signed type_id=80 bitfield_size=1 bits_offset=529
135s 	is_bool type_id=80 bitfield_size=1 bits_offset=530
135s 	is_varargs type_id=80 bitfield_size=1 bits_offset=531
135s 	float_type type_id=80 bitfield_size=4 bits_offset=532
135s 	definition_emitted type_id=80 bitfield_size=1 bits_offset=536
135s [205] CONST (anon) type_id=204
135s [206] STRUCT array_type size=56
135s 	tag type_id=172 bits_offset=0
135s 	nr_entries type_id=161 bits_offset=320
135s 	dimensions type_id=80 bits_offset=384
135s 	is_vector type_id=106 bits_offset=392
135s [207] STRUCT enumerator size=72
135s 	tag type_id=172 bits_offset=0
135s 	name type_id=44 bits_offset=320
135s 	value type_id=86 bits_offset=384
135s 	type_enum type_id=185 bits_offset=448
135s [208] CONST (anon) type_id=207
135s [209] ARRAY (anon) type_id=29 index_type_id=16 nr_elems=0
135s [210] CONST (anon) type_id=209
135s [211] STRUCT type_emissions size=56
135s 	definitions type_id=133 bits_offset=0
135s 	base_type_definitions type_id=133 bits_offset=128
135s 	fwd_decls type_id=133 bits_offset=256
135s 	conf_fprintf type_id=156 bits_offset=384
135s [212] FWD btf_encoder struct
135s [213] PTR (anon) type_id=212
135s [214] STRUCT structure size=72
135s 	node type_id=133 bits_offset=0
135s 	rb_node type_id=128 bits_offset=128
135s 	class type_id=215 bits_offset=320
135s 	cu type_id=145 bits_offset=384
135s 	id type_id=84 bits_offset=448
135s 	nr_files type_id=84 bits_offset=480
135s 	nr_methods type_id=84 bits_offset=512
135s [215] PTR (anon) type_id=202
135s [216] STRUCT (anon) size=24
135s 	str type_id=26 bits_offset=0
135s 	entries type_id=52 bits_offset=64
135s 	nr_entries type_id=16 bits_offset=128
135s 	exclude type_id=106 bits_offset=160
135s [217] FUNC_PROTO (anon) return=0 args=(218 (null))
135s [218] PTR (anon) type_id=214
135s [219] PTR (anon) type_id=217
135s [220] FUNC_PROTO (anon) return=0 args=(215 (null), 145 (null), 84 (null))
135s [221] PTR (anon) type_id=220
135s [222] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=128
135s [223] FUNC_PROTO (anon) return=0 args=(48 (null), 60 (null))
135s [224] PTR (anon) type_id=223
135s [225] CONST (anon) type_id=224
135s [226] ARRAY (anon) type_id=56 index_type_id=16 nr_elems=79
135s [227] CONST (anon) type_id=226
135s [228] ARRAY (anon) type_id=29 index_type_id=16 nr_elems=5
135s [229] CONST (anon) type_id=228
135s [230] STRUCT type_instance size=24
135s 	type type_id=231 bits_offset=0
135s 	cu type_id=145 bits_offset=64
135s 	read_already type_id=106 bits_offset=128
135s 	instance type_id=232 bits_offset=136
135s [231] PTR (anon) type_id=197
135s [232] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=0
135s [233] STRUCT prototype size=80
135s 	node type_id=133 bits_offset=0
135s 	class type_id=186 bits_offset=128
135s 	cu type_id=145 bits_offset=192
135s 	type type_id=44 bits_offset=256
135s 	type_enum type_id=44 bits_offset=320
135s 	size type_id=44 bits_offset=384
135s 	range type_id=44 bits_offset=448
135s 	filter type_id=26 bits_offset=512
135s 	nr_args type_id=82 bits_offset=576
135s 	type_enum_resolved type_id=106 bits_offset=592
135s 	name type_id=234 bits_offset=600
135s [234] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=0
135s [235] PTR (anon) type_id=230
135s [236] STRUCT thread_data size=16
135s 	btf type_id=153 bits_offset=0
135s 	encoder type_id=213 bits_offset=64
135s [237] PTR (anon) type_id=105
135s [238] PTR (anon) type_id=143
135s [239] PTR (anon) type_id=140
135s [240] PTR (anon) type_id=51
135s [241] PTR (anon) type_id=198
135s [242] PTR (anon) type_id=155
135s [243] PTR (anon) type_id=211
135s [244] PTR (anon) type_id=205
135s [245] PTR (anon) type_id=203
135s [246] PTR (anon) type_id=131
135s [247] PTR (anon) type_id=129
135s [248] PTR (anon) type_id=132
135s [249] PTR (anon) type_id=94
135s [250] PTR (anon) type_id=233
135s [251] PTR (anon) type_id=134
135s [252] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=1024
135s [253] PTR (anon) type_id=236
135s [254] PTR (anon) type_id=253
135s [255] PTR (anon) type_id=196
135s [256] PTR (anon) type_id=145
135s [257] PTR (anon) type_id=207
135s [258] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=4096
135s [259] PTR (anon) type_id=206
135s [260] PTR (anon) type_id=80
135s [261] ARRAY (anon) type_id=29 index_type_id=16 nr_elems=30
135s [262] CONST (anon) type_id=261
135s [263] PTR (anon) type_id=193
135s [264] PTR (anon) type_id=204
135s [265] ARRAY (anon) type_id=28 index_type_id=16 nr_elems=64
135s [266] ARRAY (anon) type_id=29 index_type_id=16 nr_elems=21
135s [267] CONST (anon) type_id=266
135s [268] ARRAY (anon) type_id=29 index_type_id=16 nr_elems=17
135s [269] CONST (anon) type_id=268
135s [270] PTR (anon) type_id=130
135s [271] PTR (anon) type_id=106
135s [272] PTR (anon) type_id=208
135s [273] PTR (anon) type_id=188
135s [274] PTR (anon) type_id=195
135s [275] PTR (anon) type_id=191
135s [276] PTR (anon) type_id=187
135s [277] FUNC_PROTO (anon) return=16 args=(16 argc, 73 argv)
135s [278] FUNC main type_id=277
135s [279] FUNC_PROTO (anon) return=16 args=(void)
135s [280] FUNC populate_class_names type_id=279
135s [281] FUNC_PROTO (anon) return=16 args=(44 s)
135s [282] FUNC add_class_name_entry type_id=281
135s [283] FUNC_PROTO (anon) return=16 args=(135 prototypes, 44 filename)
135s [284] FUNC prototypes__load type_id=283
135s [285] FUNC_PROTO (anon) return=16 args=(135 prototypes, 44 entry)
135s [286] FUNC prototypes__add type_id=285
135s [287] FUNC_PROTO (anon) return=139 args=(145 cu, 148 conf_load, 24 thr_data)
135s [288] FUNC pahole_stealer type_id=287
135s [289] FUNC_PROTO (anon) return=16 args=(148 conf, 16 nr_threads, 75 thr_data, 16 error)
135s [290] FUNC pahole_threads_collect type_id=289
135s [291] FUNC_PROTO (anon) return=16 args=(148 conf, 24 thr_data)
135s [292] FUNC pahole_thread_exit type_id=291
135s [293] FUNC_PROTO (anon) return=16 args=(148 conf, 16 nr_threads, 75 thr_data)
135s [294] FUNC pahole_threads_prepare type_id=293
135s [295] FUNC_PROTO (anon) return=16 args=(231 type, 145 cu, 44 type_enum)
135s [296] FUNC type__find_type_enum type_id=295
135s [297] FUNC_PROTO (anon) return=16 args=(231 type, 186 type_enum, 145 cu)
135s [298] FUNC type__add_type_enum type_id=297
135s [299] FUNC_PROTO (anon) return=255 args=(186 tag, 145 cu)
135s [300] FUNC tag_cu_node__new type_id=299
135s [301] FUNC_PROTO (anon) return=250 args=(44 expression)
135s [302] FUNC prototype__new type_id=301
135s [303] FUNC_PROTO (anon) return=201 args=(231 type, 26 sfilter)
135s [304] FUNC class_member_filter__new type_id=303
135s [305] FUNC_PROTO (anon) return=16 args=(201 filter, 231 type, 26 sfilter)
135s [306] FUNC class_member_filter__parse type_id=305
135s [307] FUNC_PROTO (anon) return=16 args=(250 prototype, 235 header, 48 input, 48 output)
135s [308] FUNC prototype__stdio_fprintf_value type_id=307
135s [309] FUNC_PROTO (anon) return=79 args=(235 instance, 48 fp)
135s [310] FUNC type__instance_read_once type_id=309
135s [311] FUNC_PROTO (anon) return=79 args=(235 instance, 44 member_name_orig)
135s [312] FUNC type_instance__int_value type_id=311
135s [313] FUNC_PROTO (anon) return=0 args=(235 instance)
135s [314] FUNC type_instance__delete type_id=313
135s [315] FUNC_PROTO (anon) return=235 args=(231 type, 145 cu)
135s [316] FUNC type_instance__new type_id=315
